byrmeng/arduino-esp32-core/boards.txt
esp32.menu.CPUFreq.240=240MHz (WiFi/BT)
esp32.menu.CPUFreq.240.build.f_cpu=240000000L
esp32.menu.CPUFreq.160=160MHz (WiFi/BT)
esp32.menu.CPUFreq.160.build.f_cpu=160000000L
esp32.menu.CPUFreq.80=80MHz (WiFi/BT)
esp32.menu.CPUFreq.80.build.f_cpu=80000000L
esp32.menu.CPUFreq.40=40MHz (40MHz XTAL)
esp32.menu.CPUFreq.40.build.f_cpu=40000000L
esp32.menu.CPUFreq.26=26MHz (26MHz XTAL)
esp32.menu.CPUFreq.26.build.f_cpu=26000000L
esp32.menu.CPUFreq.20=20MHz (40MHz XTAL)
esp32.menu.CPUFreq.20.build.f_cpu=20000000L
esp32.menu.CPUFreq.13=13MHz (26MHz XTAL)
esp32.menu.CPUFreq.13.build.f_cpu=13000000L
esp32.menu.CPUFreq.10=10MHz (40MHz XTAL)
esp32.menu.CPUFreq.10.build.f_cpu=10000000L

esp32.menu.FlashMode.qio=QIO
esp32.menu.FlashMode.qio.build.flash_mode=dio
esp32.menu.FlashMode.qio.build.boot=qio
esp32.menu.FlashMode.dio=DIO
esp32.menu.FlashMode.dio.build.flash_mode=dio
esp32.menu.FlashMode.dio.build.boot=dio

esp32.menu.FlashFreq.80=80MHz
esp32.menu.FlashFreq.80.build.flash_freq=80m
esp32.menu.FlashFreq.40=40MHz
esp32.menu.FlashFreq.40.build.flash_freq=40m

esp32.menu.FlashSize.4M=4MB (32Mb)
esp32.menu.FlashSize.4M.build.flash_size=4MB
esp32.menu.FlashSize.8M=8MB (64Mb)
esp32.menu.FlashSize.8M.build.flash_size=8MB
esp32.menu.FlashSize.2M=2MB (16Mb)
esp32.menu.FlashSize.2M.build.flash_size=2MB
esp32.menu.FlashSize.16M=16MB (128Mb)
esp32.menu.FlashSize.16M.build.flash_size=16MB

esp32.menu.UploadSpeed.921600=921600
esp32.menu.UploadSpeed.921600.upload.speed=921600
esp32.menu.UploadSpeed.115200=115200
esp32.menu.UploadSpeed.115200.upload.speed=115200
esp32.menu.UploadSpeed.256000.windows=256000
esp32.menu.UploadSpeed.256000.upload.speed=256000
esp32.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32.menu.UploadSpeed.230400=230400
esp32.menu.UploadSpeed.230400.upload.speed=230400
esp32.menu.UploadSpeed.460800.linux=460800
esp32.menu.UploadSpeed.460800.macosx=460800
esp32.menu.UploadSpeed.460800.upload.speed=460800
esp32.menu.UploadSpeed.512000.windows=512000
esp32.menu.UploadSpeed.512000.upload.speed=512000

esp32.menu.LoopCore.1=Core 1
esp32.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
esp32.menu.LoopCore.0=Core 0
esp32.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

esp32.menu.EventsCore.1=Core 1
esp32.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
esp32.menu.EventsCore.0=Core 0
esp32.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

esp32.menu.DebugLevel.none=None
esp32.menu.DebugLevel.none.build.code_debug=0
esp32.menu.DebugLevel.error=Error
esp32.menu.DebugLevel.error.build.code_debug=1
esp32.menu.DebugLevel.warn=Warn
esp32.menu.DebugLevel.warn.build.code_debug=2
esp32.menu.DebugLevel.info=Info
esp32.menu.DebugLevel.info.build.code_debug=3
esp32.menu.DebugLevel.debug=Debug
esp32.menu.DebugLevel.debug.build.code_debug=4
esp32.menu.DebugLevel.verbose=Verbose
esp32.menu.DebugLevel.verbose.build.code_debug=5

esp32.menu.EraseFlash.none=Disabled
esp32.menu.EraseFlash.none.upload.erase_cmd=
esp32.menu.EraseFlash.all=Enabled
esp32.menu.EraseFlash.all.upload.erase_cmd=-e

esp32.menu.ZigbeeMode.default=Disabled
esp32.menu.ZigbeeMode.default.build.zigbee_mode=
esp32.menu.ZigbeeMode.default.build.zigbee_libs=
esp32.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
esp32.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
esp32.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.remote

##############################################################

pocket_32.name=Dongsen Tech Pocket 32

pocket_32.bootloader.tool=esptool_py
pocket_32.bootloader.tool.default=esptool_py

pocket_32.upload.tool=esptool_py
pocket_32.upload.tool.default=esptool_py
pocket_32.upload.tool.network=esp_ota

pocket_32.upload.maximum_size=1310720
pocket_32.upload.maximum_data_size=327680
pocket_32.upload.flags=
pocket_32.upload.extra_flags=

pocket_32.serial.disableDTR=true
pocket_32.serial.disableRTS=true

pocket_32.build.tarch=xtensa
pocket_32.build.bootloader_addr=0x1000
pocket_32.build.target=esp32
pocket_32.build.mcu=esp32
pocket_32.build.core=esp32
pocket_32.build.variant=pocket_32
pocket_32.build.board=Pocket32

pocket_32.build.f_cpu=240000000L
pocket_32.build.flash_mode=dio
pocket_32.build.flash_size=4MB
pocket_32.build.boot=dio
pocket_32.build.partitions=default
pocket_32.build.defines=

pocket_32.menu.FlashFreq.80=80MHz
pocket_32.menu.FlashFreq.80.build.flash_freq=80m
pocket_32.menu.FlashFreq.40=40MHz
pocket_32.menu.FlashFreq.40.build.flash_freq=40m

pocket_32.menu.UploadSpeed.921600=921600
pocket_32.menu.UploadSpeed.921600.upload.speed=921600
pocket_32.menu.UploadSpeed.115200=115200
pocket_32.menu.UploadSpeed.115200.upload.speed=115200
pocket_32.menu.UploadSpeed.256000.windows=256000
pocket_32.menu.UploadSpeed.256000.upload.speed=256000
pocket_32.menu.UploadSpeed.230400.windows.upload.speed=256000
pocket_32.menu.UploadSpeed.230400=230400
pocket_32.menu.UploadSpeed.230400.upload.speed=230400
pocket_32.menu.UploadSpeed.460800.linux=460800
pocket_32.menu.UploadSpeed.460800.macosx=460800
pocket_32.menu.UploadSpeed.460800.upload.speed=460800
pocket_32.menu.UploadSpeed.512000.windows=512000
pocket_32.menu.UploadSpeed.512000.upload.speed=512000

pocket_32.menu.DebugLevel.none=None
pocket_32.menu.DebugLevel.none.build.code_debug=0
pocket_32.menu.DebugLevel.error=Error
pocket_32.menu.DebugLevel.error.build.code_debug=1
pocket_32.menu.DebugLevel.warn=Warn
pocket_32.menu.DebugLevel.warn.build.code_debug=2
pocket_32.menu.DebugLevel.info=Info
pocket_32.menu.DebugLevel.info.build.code_debug=3
pocket_32.menu.DebugLevel.debug=Debug
pocket_32.menu.DebugLevel.debug.build.code_debug=4
pocket_32.menu.DebugLevel.verbose=Verbose
pocket_32.menu.DebugLevel.verbose.build.code_debug=5

pocket_32.menu.EraseFlash.none=Disabled
pocket_32.menu.EraseFlash.none.upload.erase_cmd=
pocket_32.menu.EraseFlash.all=Enabled
pocket_32.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

WeMosBat.name=WeMos WiFi&Bluetooth Battery

