byrmeng/arduino-esp32-core/boards.txt
dfrobot_romeo_esp32s3.menu.FlashSize.16M=16MB (128Mb)
dfrobot_romeo_esp32s3.menu.FlashSize.16M.build.flash_size=16MB


dfrobot_romeo_esp32s3.menu.LoopCore.1=Core 1
dfrobot_romeo_esp32s3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
dfrobot_romeo_esp32s3.menu.LoopCore.0=Core 0
dfrobot_romeo_esp32s3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

dfrobot_romeo_esp32s3.menu.EventsCore.1=Core 1
dfrobot_romeo_esp32s3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
dfrobot_romeo_esp32s3.menu.EventsCore.0=Core 0
dfrobot_romeo_esp32s3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

dfrobot_romeo_esp32s3.menu.USBMode.hwcdc=Hardware CDC and JTAG
dfrobot_romeo_esp32s3.menu.USBMode.hwcdc.build.usb_mode=1
dfrobot_romeo_esp32s3.menu.USBMode.default=USB-OTG (TinyUSB)
dfrobot_romeo_esp32s3.menu.USBMode.default.build.usb_mode=0

dfrobot_romeo_esp32s3.menu.CDCOnBoot.cdc=Enabled
dfrobot_romeo_esp32s3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
dfrobot_romeo_esp32s3.menu.CDCOnBoot.default=Disabled
dfrobot_romeo_esp32s3.menu.CDCOnBoot.default.build.cdc_on_boot=0


dfrobot_romeo_esp32s3.menu.MSCOnBoot.default=Disabled
dfrobot_romeo_esp32s3.menu.MSCOnBoot.default.build.msc_on_boot=0
dfrobot_romeo_esp32s3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
dfrobot_romeo_esp32s3.menu.MSCOnBoot.msc.build.msc_on_boot=1

dfrobot_romeo_esp32s3.menu.DFUOnBoot.default=Disabled
dfrobot_romeo_esp32s3.menu.DFUOnBoot.default.build.dfu_on_boot=0
dfrobot_romeo_esp32s3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
dfrobot_romeo_esp32s3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

dfrobot_romeo_esp32s3.menu.UploadMode.default=UART0 / Hardware CDC
dfrobot_romeo_esp32s3.menu.UploadMode.default.upload.use_1200bps_touch=false
dfrobot_romeo_esp32s3.menu.UploadMode.default.upload.wait_for_upload_port=false
dfrobot_romeo_esp32s3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
dfrobot_romeo_esp32s3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
dfrobot_romeo_esp32s3.menu.UploadMode.cdc.upload.wait_for_upload_port=true

dfrobot_romeo_esp32s3.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
dfrobot_romeo_esp32s3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
dfrobot_romeo_esp32s3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
dfrobot_romeo_esp32s3.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
dfrobot_romeo_esp32s3.menu.PartitionScheme.fatflash.build.partitions=ffat
dfrobot_romeo_esp32s3.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
dfrobot_romeo_esp32s3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
dfrobot_romeo_esp32s3.menu.PartitionScheme.minimal.build.partitions=minimal
dfrobot_romeo_esp32s3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
dfrobot_romeo_esp32s3.menu.PartitionScheme.huge_app.build.partitions=huge_app
dfrobot_romeo_esp32s3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
dfrobot_romeo_esp32s3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
dfrobot_romeo_esp32s3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
dfrobot_romeo_esp32s3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
dfrobot_romeo_esp32s3.menu.PartitionScheme.rainmaker=RainMaker 4MB
dfrobot_romeo_esp32s3.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
dfrobot_romeo_esp32s3.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
dfrobot_romeo_esp32s3.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
dfrobot_romeo_esp32s3.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
dfrobot_romeo_esp32s3.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
dfrobot_romeo_esp32s3.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
dfrobot_romeo_esp32s3.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
dfrobot_romeo_esp32s3.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4116480

dfrobot_romeo_esp32s3.menu.CPUFreq.240=240MHz (WiFi)
dfrobot_romeo_esp32s3.menu.CPUFreq.240.build.f_cpu=240000000L
dfrobot_romeo_esp32s3.menu.CPUFreq.160=160MHz (WiFi)
dfrobot_romeo_esp32s3.menu.CPUFreq.160.build.f_cpu=160000000L
dfrobot_romeo_esp32s3.menu.CPUFreq.80=80MHz (WiFi)
dfrobot_romeo_esp32s3.menu.CPUFreq.80.build.f_cpu=80000000L
dfrobot_romeo_esp32s3.menu.CPUFreq.40=40MHz
dfrobot_romeo_esp32s3.menu.CPUFreq.40.build.f_cpu=40000000L
dfrobot_romeo_esp32s3.menu.CPUFreq.20=20MHz
dfrobot_romeo_esp32s3.menu.CPUFreq.20.build.f_cpu=20000000L
dfrobot_romeo_esp32s3.menu.CPUFreq.10=10MHz
dfrobot_romeo_esp32s3.menu.CPUFreq.10.build.f_cpu=10000000L

dfrobot_romeo_esp32s3.menu.UploadSpeed.921600=921600
dfrobot_romeo_esp32s3.menu.UploadSpeed.921600.upload.speed=921600
dfrobot_romeo_esp32s3.menu.UploadSpeed.115200=115200
dfrobot_romeo_esp32s3.menu.UploadSpeed.115200.upload.speed=115200
dfrobot_romeo_esp32s3.menu.UploadSpeed.256000.windows=256000
dfrobot_romeo_esp32s3.menu.UploadSpeed.256000.upload.speed=256000
dfrobot_romeo_esp32s3.menu.UploadSpeed.230400.windows.upload.speed=256000
dfrobot_romeo_esp32s3.menu.UploadSpeed.230400=230400
dfrobot_romeo_esp32s3.menu.UploadSpeed.230400.upload.speed=230400
dfrobot_romeo_esp32s3.menu.UploadSpeed.460800.linux=460800
dfrobot_romeo_esp32s3.menu.UploadSpeed.460800.macosx=460800
dfrobot_romeo_esp32s3.menu.UploadSpeed.460800.upload.speed=460800
dfrobot_romeo_esp32s3.menu.UploadSpeed.512000.windows=512000
dfrobot_romeo_esp32s3.menu.UploadSpeed.512000.upload.speed=512000

dfrobot_romeo_esp32s3.menu.DebugLevel.none=None
dfrobot_romeo_esp32s3.menu.DebugLevel.none.build.code_debug=0
dfrobot_romeo_esp32s3.menu.DebugLevel.error=Error
dfrobot_romeo_esp32s3.menu.DebugLevel.error.build.code_debug=1
dfrobot_romeo_esp32s3.menu.DebugLevel.warn=Warn
dfrobot_romeo_esp32s3.menu.DebugLevel.warn.build.code_debug=2
dfrobot_romeo_esp32s3.menu.DebugLevel.info=Info
dfrobot_romeo_esp32s3.menu.DebugLevel.info.build.code_debug=3
dfrobot_romeo_esp32s3.menu.DebugLevel.debug=Debug
dfrobot_romeo_esp32s3.menu.DebugLevel.debug.build.code_debug=4
dfrobot_romeo_esp32s3.menu.DebugLevel.verbose=Verbose
dfrobot_romeo_esp32s3.menu.DebugLevel.verbose.build.code_debug=5

dfrobot_romeo_esp32s3.menu.EraseFlash.none=Disabled
dfrobot_romeo_esp32s3.menu.EraseFlash.none.upload.erase_cmd=
dfrobot_romeo_esp32s3.menu.EraseFlash.all=Enabled
dfrobot_romeo_esp32s3.menu.EraseFlash.all.upload.erase_cmd=-e

