byrmeng/arduino-esp32-core/boards.txt
adafruit_feather_esp32c6.menu.CDCOnBoot.default=Disabled
adafruit_feather_esp32c6.menu.CDCOnBoot.default.build.cdc_on_boot=0
adafruit_feather_esp32c6.menu.CDCOnBoot.cdc=Enabled
adafruit_feather_esp32c6.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

adafruit_feather_esp32c6.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
adafruit_feather_esp32c6.menu.PartitionScheme.default.build.partitions=default
adafruit_feather_esp32c6.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
adafruit_feather_esp32c6.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
adafruit_feather_esp32c6.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
adafruit_feather_esp32c6.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
adafruit_feather_esp32c6.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
adafruit_feather_esp32c6.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
adafruit_feather_esp32c6.menu.PartitionScheme.minimal.build.partitions=minimal
adafruit_feather_esp32c6.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
adafruit_feather_esp32c6.menu.PartitionScheme.no_ota.build.partitions=no_ota
adafruit_feather_esp32c6.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
adafruit_feather_esp32c6.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
adafruit_feather_esp32c6.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
adafruit_feather_esp32c6.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
adafruit_feather_esp32c6.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
adafruit_feather_esp32c6.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
adafruit_feather_esp32c6.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
adafruit_feather_esp32c6.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
adafruit_feather_esp32c6.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
adafruit_feather_esp32c6.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
adafruit_feather_esp32c6.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
adafruit_feather_esp32c6.menu.PartitionScheme.huge_app.build.partitions=huge_app
adafruit_feather_esp32c6.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
adafruit_feather_esp32c6.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
adafruit_feather_esp32c6.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
adafruit_feather_esp32c6.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
adafruit_feather_esp32c6.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
adafruit_feather_esp32c6.menu.PartitionScheme.fatflash.build.partitions=ffat
adafruit_feather_esp32c6.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
adafruit_feather_esp32c6.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
adafruit_feather_esp32c6.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
adafruit_feather_esp32c6.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
adafruit_feather_esp32c6.menu.PartitionScheme.rainmaker=RainMaker 4MB
adafruit_feather_esp32c6.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
adafruit_feather_esp32c6.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
adafruit_feather_esp32c6.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
adafruit_feather_esp32c6.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
adafruit_feather_esp32c6.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
adafruit_feather_esp32c6.menu.PartitionScheme.zigbee=Zigbee 4MB with spiffs
adafruit_feather_esp32c6.menu.PartitionScheme.zigbee.build.partitions=zigbee
adafruit_feather_esp32c6.menu.PartitionScheme.zigbee.upload.maximum_size=1310720
adafruit_feather_esp32c6.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
adafruit_feather_esp32c6.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
adafruit_feather_esp32c6.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
adafruit_feather_esp32c6.menu.PartitionScheme.custom=Custom
adafruit_feather_esp32c6.menu.PartitionScheme.custom.build.partitions=
adafruit_feather_esp32c6.menu.PartitionScheme.custom.upload.maximum_size=16777216

adafruit_feather_esp32c6.menu.CPUFreq.160=160MHz (WiFi)
adafruit_feather_esp32c6.menu.CPUFreq.160.build.f_cpu=160000000L
adafruit_feather_esp32c6.menu.CPUFreq.120=120MHz (WiFi)
adafruit_feather_esp32c6.menu.CPUFreq.120.build.f_cpu=120000000L
adafruit_feather_esp32c6.menu.CPUFreq.80=80MHz (WiFi)
adafruit_feather_esp32c6.menu.CPUFreq.80.build.f_cpu=80000000L
adafruit_feather_esp32c6.menu.CPUFreq.40=40MHz
adafruit_feather_esp32c6.menu.CPUFreq.40.build.f_cpu=40000000L
adafruit_feather_esp32c6.menu.CPUFreq.20=20MHz
adafruit_feather_esp32c6.menu.CPUFreq.20.build.f_cpu=20000000L
adafruit_feather_esp32c6.menu.CPUFreq.10=10MHz
adafruit_feather_esp32c6.menu.CPUFreq.10.build.f_cpu=10000000L

adafruit_feather_esp32c6.menu.FlashMode.qio=QIO
adafruit_feather_esp32c6.menu.FlashMode.qio.build.flash_mode=dio
adafruit_feather_esp32c6.menu.FlashMode.qio.build.boot=qio
adafruit_feather_esp32c6.menu.FlashMode.dio=DIO
adafruit_feather_esp32c6.menu.FlashMode.dio.build.flash_mode=dio
adafruit_feather_esp32c6.menu.FlashMode.dio.build.boot=dio

adafruit_feather_esp32c6.menu.FlashFreq.80=80MHz
adafruit_feather_esp32c6.menu.FlashFreq.80.build.flash_freq=80m
adafruit_feather_esp32c6.menu.FlashFreq.40=40MHz
adafruit_feather_esp32c6.menu.FlashFreq.40.build.flash_freq=40m

adafruit_feather_esp32c6.menu.UploadSpeed.921600=921600
adafruit_feather_esp32c6.menu.UploadSpeed.921600.upload.speed=921600
adafruit_feather_esp32c6.menu.UploadSpeed.115200=115200
adafruit_feather_esp32c6.menu.UploadSpeed.115200.upload.speed=115200
adafruit_feather_esp32c6.menu.UploadSpeed.256000.windows=256000
adafruit_feather_esp32c6.menu.UploadSpeed.256000.upload.speed=256000
adafruit_feather_esp32c6.menu.UploadSpeed.230400.windows.upload.speed=256000
adafruit_feather_esp32c6.menu.UploadSpeed.230400=230400
adafruit_feather_esp32c6.menu.UploadSpeed.230400.upload.speed=230400
adafruit_feather_esp32c6.menu.UploadSpeed.460800.linux=460800
adafruit_feather_esp32c6.menu.UploadSpeed.460800.macosx=460800
adafruit_feather_esp32c6.menu.UploadSpeed.460800.upload.speed=460800
adafruit_feather_esp32c6.menu.UploadSpeed.512000.windows=512000
adafruit_feather_esp32c6.menu.UploadSpeed.512000.upload.speed=512000

