byrmeng/arduino-esp32-core/boards.txt
##############################################################
# Adafruit pyCamera S3

adafruit_camera_esp32s3.name=Adafruit pyCamera S3
adafruit_camera_esp32s3.vid.0=0x239A
adafruit_camera_esp32s3.pid.0=0x0117
adafruit_camera_esp32s3.vid.1=0x239A
adafruit_camera_esp32s3.pid.1=0x8117
adafruit_camera_esp32s3.vid.2=0x239A
adafruit_camera_esp32s3.pid.2=0x8118
adafruit_camera_esp32s3.upload_port.0.vid=0x239A
adafruit_camera_esp32s3.upload_port.0.pid=0x0117
adafruit_camera_esp32s3.upload_port.1.vid=0x239A
adafruit_camera_esp32s3.upload_port.1.pid=0x8117
adafruit_camera_esp32s3.upload_port.2.vid=0x239A
adafruit_camera_esp32s3.upload_port.2.pid=0x8118

adafruit_camera_esp32s3.bootloader.tool=esptool_py
adafruit_camera_esp32s3.bootloader.tool.default=esptool_py

adafruit_camera_esp32s3.upload.tool=esptool_py
adafruit_camera_esp32s3.upload.tool.default=esptool_py
adafruit_camera_esp32s3.upload.tool.network=esp_ota

adafruit_camera_esp32s3.upload.maximum_size=1310720
adafruit_camera_esp32s3.upload.maximum_data_size=327680
adafruit_camera_esp32s3.upload.flags=
adafruit_camera_esp32s3.upload.extra_flags=
adafruit_camera_esp32s3.upload.use_1200bps_touch=true
adafruit_camera_esp32s3.upload.wait_for_upload_port=true

adafruit_camera_esp32s3.serial.disableDTR=false
adafruit_camera_esp32s3.serial.disableRTS=false

adafruit_camera_esp32s3.build.tarch=xtensa
adafruit_camera_esp32s3.build.bootloader_addr=0x0
adafruit_camera_esp32s3.build.target=esp32s3
adafruit_camera_esp32s3.build.mcu=esp32s3
adafruit_camera_esp32s3.build.core=esp32
adafruit_camera_esp32s3.build.variant=adafruit_camera_esp32s3
adafruit_camera_esp32s3.build.board=ADAFRUIT_CAMERA_ESP32S3

adafruit_camera_esp32s3.build.usb_mode=0
adafruit_camera_esp32s3.build.cdc_on_boot=1
adafruit_camera_esp32s3.build.msc_on_boot=0
adafruit_camera_esp32s3.build.dfu_on_boot=0
adafruit_camera_esp32s3.build.f_cpu=240000000L
adafruit_camera_esp32s3.build.flash_size=4MB
adafruit_camera_esp32s3.build.flash_freq=80m
adafruit_camera_esp32s3.build.flash_mode=dio
adafruit_camera_esp32s3.build.boot=qio
adafruit_camera_esp32s3.build.partitions=default
adafruit_camera_esp32s3.build.defines=
adafruit_camera_esp32s3.build.loop_core=
adafruit_camera_esp32s3.build.event_core=
adafruit_camera_esp32s3.build.flash_type=qio
adafruit_camera_esp32s3.build.psram_type=qspi
adafruit_camera_esp32s3.build.memory_type={build.flash_type}_{build.psram_type}

adafruit_camera_esp32s3.menu.LoopCore.1=Core 1
adafruit_camera_esp32s3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
adafruit_camera_esp32s3.menu.LoopCore.0=Core 0
adafruit_camera_esp32s3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

adafruit_camera_esp32s3.menu.EventsCore.1=Core 1
adafruit_camera_esp32s3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
adafruit_camera_esp32s3.menu.EventsCore.0=Core 0
adafruit_camera_esp32s3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

adafruit_camera_esp32s3.menu.USBMode.default=USB-OTG (TinyUSB)
adafruit_camera_esp32s3.menu.USBMode.default.build.usb_mode=0
adafruit_camera_esp32s3.menu.USBMode.hwcdc=Hardware CDC and JTAG
adafruit_camera_esp32s3.menu.USBMode.hwcdc.build.usb_mode=1

adafruit_camera_esp32s3.menu.CDCOnBoot.cdc=Enabled
adafruit_camera_esp32s3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
adafruit_camera_esp32s3.menu.CDCOnBoot.default=Disabled
adafruit_camera_esp32s3.menu.CDCOnBoot.default.build.cdc_on_boot=0

adafruit_camera_esp32s3.menu.MSCOnBoot.default=Disabled
adafruit_camera_esp32s3.menu.MSCOnBoot.default.build.msc_on_boot=0
adafruit_camera_esp32s3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
adafruit_camera_esp32s3.menu.MSCOnBoot.msc.build.msc_on_boot=1

adafruit_camera_esp32s3.menu.DFUOnBoot.default=Disabled
adafruit_camera_esp32s3.menu.DFUOnBoot.default.build.dfu_on_boot=0
adafruit_camera_esp32s3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
adafruit_camera_esp32s3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

adafruit_camera_esp32s3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
adafruit_camera_esp32s3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
adafruit_camera_esp32s3.menu.UploadMode.cdc.upload.wait_for_upload_port=true
adafruit_camera_esp32s3.menu.UploadMode.default=UART0 / Hardware CDC
adafruit_camera_esp32s3.menu.UploadMode.default.upload.use_1200bps_touch=false
adafruit_camera_esp32s3.menu.UploadMode.default.upload.wait_for_upload_port=false

adafruit_camera_esp32s3.menu.PSRAM.enabled=QSPI PSRAM
adafruit_camera_esp32s3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
adafruit_camera_esp32s3.menu.PSRAM.enabled.build.psram_type=qspi
adafruit_camera_esp32s3.menu.PSRAM.disabled=Disabled
adafruit_camera_esp32s3.menu.PSRAM.disabled.build.defines=
adafruit_camera_esp32s3.menu.PSRAM.disabled.build.psram_type=qspi
adafruit_camera_esp32s3.menu.PSRAM.opi=OPI PSRAM
adafruit_camera_esp32s3.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
adafruit_camera_esp32s3.menu.PSRAM.opi.build.psram_type=opi

adafruit_camera_esp32s3.menu.PartitionScheme.tinyuf2_noota=TinyUF2 4MB No OTA (2.7MB APP/960KB FATFS)
adafruit_camera_esp32s3.menu.PartitionScheme.tinyuf2_noota.build.custom_bootloader=bootloader-tinyuf2
adafruit_camera_esp32s3.menu.PartitionScheme.tinyuf2_noota.build.partitions=tinyuf2-partitions-4MB-noota
adafruit_camera_esp32s3.menu.PartitionScheme.tinyuf2_noota.upload.maximum_size=2883584
adafruit_camera_esp32s3.menu.PartitionScheme.tinyuf2_noota.upload.extra_flags=0x2d0000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
adafruit_camera_esp32s3.menu.PartitionScheme.tinyuf2=TinyUF2 4MB (1.3MB APP/960KB FATFS)
adafruit_camera_esp32s3.menu.PartitionScheme.tinyuf2.build.custom_bootloader=bootloader-tinyuf2
adafruit_camera_esp32s3.menu.PartitionScheme.tinyuf2.build.partitions=tinyuf2-partitions-4MB
adafruit_camera_esp32s3.menu.PartitionScheme.tinyuf2.upload.maximum_size=1441792
adafruit_camera_esp32s3.menu.PartitionScheme.tinyuf2.upload.extra_flags=0x2d0000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
adafruit_camera_esp32s3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
adafruit_camera_esp32s3.menu.PartitionScheme.default.build.partitions=default
adafruit_camera_esp32s3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
adafruit_camera_esp32s3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
adafruit_camera_esp32s3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
adafruit_camera_esp32s3.menu.PartitionScheme.minimal.build.partitions=minimal
adafruit_camera_esp32s3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
adafruit_camera_esp32s3.menu.PartitionScheme.no_ota.build.partitions=no_ota
adafruit_camera_esp32s3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
adafruit_camera_esp32s3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
adafruit_camera_esp32s3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
adafruit_camera_esp32s3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
adafruit_camera_esp32s3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
adafruit_camera_esp32s3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
adafruit_camera_esp32s3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
adafruit_camera_esp32s3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
adafruit_camera_esp32s3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
adafruit_camera_esp32s3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
adafruit_camera_esp32s3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
adafruit_camera_esp32s3.menu.PartitionScheme.huge_app.build.partitions=huge_app
adafruit_camera_esp32s3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
adafruit_camera_esp32s3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
adafruit_camera_esp32s3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
adafruit_camera_esp32s3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

