byrmeng/arduino-esp32-core/boards.txt
##############################################################
# Adafruit Sparkle Motion w/ESP32

sparklemotion.name=Adafruit Sparkle Motion (ESP32)

sparklemotion.bootloader.tool=esptool_py
sparklemotion.bootloader.tool.default=esptool_py

sparklemotion.upload.tool=esptool_py
sparklemotion.upload.tool.default=esptool_py
sparklemotion.upload.tool.network=esp_ota

sparklemotion.upload.maximum_size=1310720
sparklemotion.upload.maximum_data_size=327680
sparklemotion.upload.flags=
sparklemotion.upload.extra_flags=

sparklemotion.serial.disableDTR=true
sparklemotion.serial.disableRTS=true

sparklemotion.build.tarch=xtensa
sparklemotion.build.bootloader_addr=0x1000
sparklemotion.build.target=esp32
sparklemotion.build.mcu=esp32
sparklemotion.build.core=esp32
sparklemotion.build.variant=adafruit_sparklemotion_esp32
sparklemotion.build.board=SPARKLEMOTION_ESP32

sparklemotion.build.f_cpu=240000000L
sparklemotion.build.flash_size=4MB
sparklemotion.build.flash_freq=80m
sparklemotion.build.flash_mode=dio
sparklemotion.build.boot=dio
sparklemotion.build.partitions=default
sparklemotion.build.defines=
sparklemotion.build.loop_core=
sparklemotion.build.event_core=

sparklemotion.menu.LoopCore.1=Core 1
sparklemotion.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
sparklemotion.menu.LoopCore.0=Core 0
sparklemotion.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

sparklemotion.menu.EventsCore.1=Core 1
sparklemotion.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
sparklemotion.menu.EventsCore.0=Core 0
sparklemotion.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

sparklemotion.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
sparklemotion.menu.PartitionScheme.default.build.partitions=default
sparklemotion.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
sparklemotion.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
sparklemotion.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
sparklemotion.menu.PartitionScheme.minimal.build.partitions=minimal
sparklemotion.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
sparklemotion.menu.PartitionScheme.no_ota.build.partitions=no_ota
sparklemotion.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
sparklemotion.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
sparklemotion.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
sparklemotion.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
sparklemotion.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
sparklemotion.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
sparklemotion.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
sparklemotion.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
sparklemotion.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
sparklemotion.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
sparklemotion.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
sparklemotion.menu.PartitionScheme.huge_app.build.partitions=huge_app
sparklemotion.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
sparklemotion.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
sparklemotion.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
sparklemotion.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

sparklemotion.menu.CPUFreq.240=240MHz (WiFi/BT)
sparklemotion.menu.CPUFreq.240.build.f_cpu=240000000L
sparklemotion.menu.CPUFreq.160=160MHz (WiFi/BT)
sparklemotion.menu.CPUFreq.160.build.f_cpu=160000000L
sparklemotion.menu.CPUFreq.80=80MHz (WiFi/BT)
sparklemotion.menu.CPUFreq.80.build.f_cpu=80000000L
sparklemotion.menu.CPUFreq.40=40MHz
sparklemotion.menu.CPUFreq.40.build.f_cpu=40000000L
sparklemotion.menu.CPUFreq.20=20MHz
sparklemotion.menu.CPUFreq.20.build.f_cpu=20000000L
sparklemotion.menu.CPUFreq.10=10MHz
sparklemotion.menu.CPUFreq.10.build.f_cpu=10000000L

sparklemotion.menu.FlashFreq.80=80MHz
sparklemotion.menu.FlashFreq.80.build.flash_freq=80m
sparklemotion.menu.FlashFreq.40=40MHz
sparklemotion.menu.FlashFreq.40.build.flash_freq=40m

sparklemotion.menu.FlashSize.4M=4MB (32Mb)
sparklemotion.menu.FlashSize.4M.build.flash_size=4MB

sparklemotion.menu.UploadSpeed.921600=921600
sparklemotion.menu.UploadSpeed.921600.upload.speed=921600
sparklemotion.menu.UploadSpeed.115200=115200
sparklemotion.menu.UploadSpeed.115200.upload.speed=115200
sparklemotion.menu.UploadSpeed.256000.windows=256000
sparklemotion.menu.UploadSpeed.256000.upload.speed=256000
sparklemotion.menu.UploadSpeed.230400.windows.upload.speed=256000
sparklemotion.menu.UploadSpeed.230400=230400
sparklemotion.menu.UploadSpeed.230400.upload.speed=230400
sparklemotion.menu.UploadSpeed.460800.linux=460800
sparklemotion.menu.UploadSpeed.460800.macosx=460800
sparklemotion.menu.UploadSpeed.460800.upload.speed=460800
sparklemotion.menu.UploadSpeed.512000.windows=512000
sparklemotion.menu.UploadSpeed.512000.upload.speed=512000

sparklemotion.menu.DebugLevel.none=None
sparklemotion.menu.DebugLevel.none.build.code_debug=0
sparklemotion.menu.DebugLevel.error=Error
sparklemotion.menu.DebugLevel.error.build.code_debug=1
sparklemotion.menu.DebugLevel.warn=Warn
sparklemotion.menu.DebugLevel.warn.build.code_debug=2
sparklemotion.menu.DebugLevel.info=Info
sparklemotion.menu.DebugLevel.info.build.code_debug=3
sparklemotion.menu.DebugLevel.debug=Debug
sparklemotion.menu.DebugLevel.debug.build.code_debug=4
sparklemotion.menu.DebugLevel.verbose=Verbose
sparklemotion.menu.DebugLevel.verbose.build.code_debug=5

sparklemotion.menu.EraseFlash.none=Disabled
sparklemotion.menu.EraseFlash.none.upload.erase_cmd=
sparklemotion.menu.EraseFlash.all=Enabled
sparklemotion.menu.EraseFlash.all.upload.erase_cmd=-e

sparklemotion.menu.ZigbeeMode.default=Disabled
sparklemotion.menu.ZigbeeMode.default.build.zigbee_mode=
sparklemotion.menu.ZigbeeMode.default.build.zigbee_libs=
sparklemotion.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
sparklemotion.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
sparklemotion.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.remote

