byrmeng/arduino-esp32-core/boards.txt
##############################################################
# Adafruit Sparkle Motion Mini w/ESP32

sparklemotionmini.name=Adafruit Sparkle Motion Mini (ESP32)

sparklemotionmini.bootloader.tool=esptool_py
sparklemotionmini.bootloader.tool.default=esptool_py

sparklemotionmini.upload.tool=esptool_py
sparklemotionmini.upload.tool.default=esptool_py
sparklemotionmini.upload.tool.network=esp_ota

sparklemotionmini.upload.maximum_size=1310720
sparklemotionmini.upload.maximum_data_size=327680
sparklemotionmini.upload.flags=
sparklemotionmini.upload.extra_flags=

sparklemotionmini.serial.disableDTR=true
sparklemotionmini.serial.disableRTS=true

sparklemotionmini.build.tarch=xtensa
sparklemotionmini.build.bootloader_addr=0x1000
sparklemotionmini.build.target=esp32
sparklemotionmini.build.mcu=esp32
sparklemotionmini.build.core=esp32
sparklemotionmini.build.variant=adafruit_sparklemotionmini_esp32
sparklemotionmini.build.board=SPARKLEMOTIONMINI_ESP32

sparklemotionmini.build.f_cpu=240000000L
sparklemotionmini.build.flash_size=4MB
sparklemotionmini.build.flash_freq=80m
sparklemotionmini.build.flash_mode=dio
sparklemotionmini.build.boot=dio
sparklemotionmini.build.partitions=default
sparklemotionmini.build.defines=
sparklemotionmini.build.loop_core=
sparklemotionmini.build.event_core=

sparklemotionmini.menu.LoopCore.1=Core 1
sparklemotionmini.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
sparklemotionmini.menu.LoopCore.0=Core 0
sparklemotionmini.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

sparklemotionmini.menu.EventsCore.1=Core 1
sparklemotionmini.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
sparklemotionmini.menu.EventsCore.0=Core 0
sparklemotionmini.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

sparklemotionmini.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
sparklemotionmini.menu.PartitionScheme.default.build.partitions=default
sparklemotionmini.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
sparklemotionmini.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
sparklemotionmini.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
sparklemotionmini.menu.PartitionScheme.minimal.build.partitions=minimal
sparklemotionmini.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
sparklemotionmini.menu.PartitionScheme.no_ota.build.partitions=no_ota
sparklemotionmini.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
sparklemotionmini.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
sparklemotionmini.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
sparklemotionmini.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
sparklemotionmini.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
sparklemotionmini.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
sparklemotionmini.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
sparklemotionmini.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
sparklemotionmini.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
sparklemotionmini.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
sparklemotionmini.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
sparklemotionmini.menu.PartitionScheme.huge_app.build.partitions=huge_app
sparklemotionmini.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
sparklemotionmini.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
sparklemotionmini.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
sparklemotionmini.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

sparklemotionmini.menu.CPUFreq.240=240MHz (WiFi/BT)
sparklemotionmini.menu.CPUFreq.240.build.f_cpu=240000000L
sparklemotionmini.menu.CPUFreq.160=160MHz (WiFi/BT)
sparklemotionmini.menu.CPUFreq.160.build.f_cpu=160000000L
sparklemotionmini.menu.CPUFreq.80=80MHz (WiFi/BT)
sparklemotionmini.menu.CPUFreq.80.build.f_cpu=80000000L
sparklemotionmini.menu.CPUFreq.40=40MHz
sparklemotionmini.menu.CPUFreq.40.build.f_cpu=40000000L
sparklemotionmini.menu.CPUFreq.20=20MHz
sparklemotionmini.menu.CPUFreq.20.build.f_cpu=20000000L
sparklemotionmini.menu.CPUFreq.10=10MHz
sparklemotionmini.menu.CPUFreq.10.build.f_cpu=10000000L

sparklemotionmini.menu.FlashFreq.80=80MHz
sparklemotionmini.menu.FlashFreq.80.build.flash_freq=80m
sparklemotionmini.menu.FlashFreq.40=40MHz
sparklemotionmini.menu.FlashFreq.40.build.flash_freq=40m

sparklemotionmini.menu.FlashSize.4M=4MB (32Mb)
sparklemotionmini.menu.FlashSize.4M.build.flash_size=4MB

sparklemotionmini.menu.UploadSpeed.921600=921600
sparklemotionmini.menu.UploadSpeed.921600.upload.speed=921600
sparklemotionmini.menu.UploadSpeed.115200=115200
sparklemotionmini.menu.UploadSpeed.115200.upload.speed=115200
sparklemotionmini.menu.UploadSpeed.256000.windows=256000
sparklemotionmini.menu.UploadSpeed.256000.upload.speed=256000
sparklemotionmini.menu.UploadSpeed.230400.windows.upload.speed=256000
sparklemotionmini.menu.UploadSpeed.230400=230400
sparklemotionmini.menu.UploadSpeed.230400.upload.speed=230400
sparklemotionmini.menu.UploadSpeed.460800.linux=460800
sparklemotionmini.menu.UploadSpeed.460800.macosx=460800
sparklemotionmini.menu.UploadSpeed.460800.upload.speed=460800
sparklemotionmini.menu.UploadSpeed.512000.windows=512000
sparklemotionmini.menu.UploadSpeed.512000.upload.speed=512000

sparklemotionmini.menu.DebugLevel.none=None
sparklemotionmini.menu.DebugLevel.none.build.code_debug=0
sparklemotionmini.menu.DebugLevel.error=Error
sparklemotionmini.menu.DebugLevel.error.build.code_debug=1
sparklemotionmini.menu.DebugLevel.warn=Warn
sparklemotionmini.menu.DebugLevel.warn.build.code_debug=2
sparklemotionmini.menu.DebugLevel.info=Info
sparklemotionmini.menu.DebugLevel.info.build.code_debug=3
sparklemotionmini.menu.DebugLevel.debug=Debug
sparklemotionmini.menu.DebugLevel.debug.build.code_debug=4
sparklemotionmini.menu.DebugLevel.verbose=Verbose
sparklemotionmini.menu.DebugLevel.verbose.build.code_debug=5

