byrmeng/arduino-esp32-core/boards.txt
nologo_esp32s3_pico.menu.DebugLevel.none=None
nologo_esp32s3_pico.menu.DebugLevel.none.build.code_debug=0
nologo_esp32s3_pico.menu.DebugLevel.error=Error
nologo_esp32s3_pico.menu.DebugLevel.error.build.code_debug=1
nologo_esp32s3_pico.menu.DebugLevel.warn=Warn
nologo_esp32s3_pico.menu.DebugLevel.warn.build.code_debug=2
nologo_esp32s3_pico.menu.DebugLevel.info=Info
nologo_esp32s3_pico.menu.DebugLevel.info.build.code_debug=3
nologo_esp32s3_pico.menu.DebugLevel.debug=Debug
nologo_esp32s3_pico.menu.DebugLevel.debug.build.code_debug=4
nologo_esp32s3_pico.menu.DebugLevel.verbose=Verbose
nologo_esp32s3_pico.menu.DebugLevel.verbose.build.code_debug=5

nologo_esp32s3_pico.menu.EraseFlash.none=Disabled
nologo_esp32s3_pico.menu.EraseFlash.none.upload.erase_cmd=
nologo_esp32s3_pico.menu.EraseFlash.all=Enabled
nologo_esp32s3_pico.menu.EraseFlash.all.upload.erase_cmd=-e

nologo_esp32s3_pico.menu.ZigbeeMode.default=Disabled
nologo_esp32s3_pico.menu.ZigbeeMode.default.build.zigbee_mode=
nologo_esp32s3_pico.menu.ZigbeeMode.default.build.zigbee_libs=
nologo_esp32s3_pico.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
nologo_esp32s3_pico.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
nologo_esp32s3_pico.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.remote

##############################################################

mhetesp32devkit.name=MH ET LIVE ESP32DevKIT

mhetesp32devkit.bootloader.tool=esptool_py
mhetesp32devkit.bootloader.tool.default=esptool_py

mhetesp32devkit.upload.tool=esptool_py
mhetesp32devkit.upload.tool.default=esptool_py
mhetesp32devkit.upload.tool.network=esp_ota

mhetesp32devkit.upload.maximum_size=1310720
mhetesp32devkit.upload.maximum_data_size=327680
mhetesp32devkit.upload.flags=
mhetesp32devkit.upload.extra_flags=

mhetesp32devkit.serial.disableDTR=true
mhetesp32devkit.serial.disableRTS=true

mhetesp32devkit.build.tarch=xtensa
mhetesp32devkit.build.bootloader_addr=0x1000
mhetesp32devkit.build.target=esp32
mhetesp32devkit.build.mcu=esp32
mhetesp32devkit.build.core=esp32
mhetesp32devkit.build.variant=mhetesp32devkit
mhetesp32devkit.build.board=MH_ET_LIVE_ESP32DEVKIT

mhetesp32devkit.build.f_cpu=240000000L
mhetesp32devkit.build.flash_mode=dio
mhetesp32devkit.build.flash_size=4MB
mhetesp32devkit.build.boot=dio
mhetesp32devkit.build.partitions=default
mhetesp32devkit.build.defines=

mhetesp32devkit.menu.FlashFreq.80=80MHz
mhetesp32devkit.menu.FlashFreq.80.build.flash_freq=80m
mhetesp32devkit.menu.FlashFreq.40=40MHz
mhetesp32devkit.menu.FlashFreq.40.build.flash_freq=40m

mhetesp32devkit.menu.PartitionScheme.default=Default
mhetesp32devkit.menu.PartitionScheme.default.build.partitions=default
mhetesp32devkit.menu.PartitionScheme.no_ota=No OTA (Large APP)
mhetesp32devkit.menu.PartitionScheme.no_ota.build.partitions=no_ota
mhetesp32devkit.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
mhetesp32devkit.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
mhetesp32devkit.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
mhetesp32devkit.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

mhetesp32devkit.menu.UploadSpeed.921600=921600
mhetesp32devkit.menu.UploadSpeed.921600.upload.speed=921600
mhetesp32devkit.menu.UploadSpeed.115200=115200
mhetesp32devkit.menu.UploadSpeed.115200.upload.speed=115200
mhetesp32devkit.menu.UploadSpeed.256000.windows=256000
mhetesp32devkit.menu.UploadSpeed.256000.upload.speed=256000
mhetesp32devkit.menu.UploadSpeed.230400.windows.upload.speed=256000
mhetesp32devkit.menu.UploadSpeed.230400=230400
mhetesp32devkit.menu.UploadSpeed.230400.upload.speed=230400
mhetesp32devkit.menu.UploadSpeed.460800.linux=460800
mhetesp32devkit.menu.UploadSpeed.460800.macosx=460800
mhetesp32devkit.menu.UploadSpeed.460800.upload.speed=460800
mhetesp32devkit.menu.UploadSpeed.512000.windows=512000
mhetesp32devkit.menu.UploadSpeed.512000.upload.speed=512000

mhetesp32devkit.menu.DebugLevel.none=None
mhetesp32devkit.menu.DebugLevel.none.build.code_debug=0
mhetesp32devkit.menu.DebugLevel.error=Error
mhetesp32devkit.menu.DebugLevel.error.build.code_debug=1
mhetesp32devkit.menu.DebugLevel.warn=Warn
mhetesp32devkit.menu.DebugLevel.warn.build.code_debug=2
mhetesp32devkit.menu.DebugLevel.info=Info
mhetesp32devkit.menu.DebugLevel.info.build.code_debug=3
mhetesp32devkit.menu.DebugLevel.debug=Debug
mhetesp32devkit.menu.DebugLevel.debug.build.code_debug=4
mhetesp32devkit.menu.DebugLevel.verbose=Verbose
mhetesp32devkit.menu.DebugLevel.verbose.build.code_debug=5

mhetesp32devkit.menu.EraseFlash.none=Disabled
mhetesp32devkit.menu.EraseFlash.none.upload.erase_cmd=
mhetesp32devkit.menu.EraseFlash.all=Enabled
mhetesp32devkit.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

mhetesp32minikit.name=MH ET LIVE ESP32MiniKit

mhetesp32minikit.bootloader.tool=esptool_py
mhetesp32minikit.bootloader.tool.default=esptool_py

mhetesp32minikit.upload.tool=esptool_py
mhetesp32minikit.upload.tool.default=esptool_py
mhetesp32minikit.upload.tool.network=esp_ota

mhetesp32minikit.upload.maximum_size=1310720
mhetesp32minikit.upload.maximum_data_size=327680
mhetesp32minikit.upload.flags=
mhetesp32minikit.upload.extra_flags=

mhetesp32minikit.serial.disableDTR=true
mhetesp32minikit.serial.disableRTS=true

mhetesp32minikit.build.tarch=xtensa
mhetesp32minikit.build.bootloader_addr=0x1000
mhetesp32minikit.build.target=esp32
mhetesp32minikit.build.mcu=esp32
mhetesp32minikit.build.core=esp32
mhetesp32minikit.build.variant=mhetesp32minikit
mhetesp32minikit.build.board=MH_ET_LIVE_ESP32MINIKIT

mhetesp32minikit.build.f_cpu=240000000L
mhetesp32minikit.build.flash_mode=dio
mhetesp32minikit.build.flash_size=4MB
mhetesp32minikit.build.boot=dio
mhetesp32minikit.build.partitions=default
mhetesp32minikit.build.defines=

mhetesp32minikit.menu.FlashFreq.80=80MHz
mhetesp32minikit.menu.FlashFreq.80.build.flash_freq=80m
mhetesp32minikit.menu.FlashFreq.40=40MHz
mhetesp32minikit.menu.FlashFreq.40.build.flash_freq=40m

mhetesp32minikit.menu.PartitionScheme.default=Default with spiffs
mhetesp32minikit.menu.PartitionScheme.default.build.partitions=default
mhetesp32minikit.menu.PartitionScheme.defaultffat=Default with ffat
mhetesp32minikit.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
mhetesp32minikit.menu.PartitionScheme.no_ota=No OTA (Large APP)
mhetesp32minikit.menu.PartitionScheme.no_ota.build.partitions=no_ota
mhetesp32minikit.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
mhetesp32minikit.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
mhetesp32minikit.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
mhetesp32minikit.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

