byrmeng/arduino-esp32-core/boards.txt
##############################################################

esp32doit-espduino.name=DOIT ESPduino32

esp32doit-espduino.bootloader.tool=esptool_py
esp32doit-espduino.bootloader.tool.default=esptool_py

esp32doit-espduino.upload.tool=esptool_py
esp32doit-espduino.upload.tool.default=esptool_py
esp32doit-espduino.upload.tool.network=esp_ota

esp32doit-espduino.upload.maximum_size=1310720
esp32doit-espduino.upload.maximum_data_size=327680
esp32doit-espduino.upload.wait_for_upload_port=true
esp32doit-espduino.upload.flags=
esp32doit-espduino.upload.extra_flags=

esp32doit-espduino.serial.disableDTR=true
esp32doit-espduino.serial.disableRTS=true

esp32doit-espduino.build.tarch=xtensa
esp32doit-espduino.build.bootloader_addr=0x1000
esp32doit-espduino.build.target=esp32
esp32doit-espduino.build.mcu=esp32
esp32doit-espduino.build.core=esp32
esp32doit-espduino.build.variant=doitESPduino32
esp32doit-espduino.build.board=ESP32_DEV

esp32doit-espduino.build.f_cpu=240000000L
esp32doit-espduino.build.flash_mode=dio
esp32doit-espduino.build.flash_size=4MB
esp32doit-espduino.build.boot=dio
esp32doit-espduino.build.partitions=default
esp32doit-espduino.build.defines=

esp32doit-espduino.menu.FlashFreq.80=80MHz
esp32doit-espduino.menu.FlashFreq.80.build.flash_freq=80m
esp32doit-espduino.menu.FlashFreq.40=40MHz
esp32doit-espduino.menu.FlashFreq.40.build.flash_freq=40m

esp32doit-espduino.menu.PartitionScheme.default=Default
esp32doit-espduino.menu.PartitionScheme.default.build.partitions=default
esp32doit-espduino.menu.PartitionScheme.no_ota=No OTA (Large APP)
esp32doit-espduino.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32doit-espduino.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32doit-espduino.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
esp32doit-espduino.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32doit-espduino.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

esp32doit-espduino.menu.CPUFreq.240=240MHz (WiFi/BT)
esp32doit-espduino.menu.CPUFreq.240.build.f_cpu=240000000L
esp32doit-espduino.menu.CPUFreq.160=160MHz (WiFi/BT)
esp32doit-espduino.menu.CPUFreq.160.build.f_cpu=160000000L
esp32doit-espduino.menu.CPUFreq.80=80MHz (WiFi/BT)
esp32doit-espduino.menu.CPUFreq.80.build.f_cpu=80000000L
esp32doit-espduino.menu.CPUFreq.40=40MHz (40MHz XTAL)
esp32doit-espduino.menu.CPUFreq.40.build.f_cpu=40000000L
esp32doit-espduino.menu.CPUFreq.26=26MHz (26MHz XTAL)
esp32doit-espduino.menu.CPUFreq.26.build.f_cpu=26000000L
esp32doit-espduino.menu.CPUFreq.20=20MHz (40MHz XTAL)
esp32doit-espduino.menu.CPUFreq.20.build.f_cpu=20000000L
esp32doit-espduino.menu.CPUFreq.13=13MHz (26MHz XTAL)
esp32doit-espduino.menu.CPUFreq.13.build.f_cpu=13000000L
esp32doit-espduino.menu.CPUFreq.10=10MHz (40MHz XTAL)
esp32doit-espduino.menu.CPUFreq.10.build.f_cpu=10000000L

esp32doit-espduino.menu.UploadSpeed.921600=921600
esp32doit-espduino.menu.UploadSpeed.921600.upload.speed=921600
esp32doit-espduino.menu.UploadSpeed.115200=115200
esp32doit-espduino.menu.UploadSpeed.115200.upload.speed=115200
esp32doit-espduino.menu.UploadSpeed.256000.windows=256000
esp32doit-espduino.menu.UploadSpeed.256000.upload.speed=256000
esp32doit-espduino.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32doit-espduino.menu.UploadSpeed.230400=230400
esp32doit-espduino.menu.UploadSpeed.230400.upload.speed=230400
esp32doit-espduino.menu.UploadSpeed.460800.linux=460800
esp32doit-espduino.menu.UploadSpeed.460800.macosx=460800
esp32doit-espduino.menu.UploadSpeed.460800.upload.speed=460800
esp32doit-espduino.menu.UploadSpeed.512000.windows=512000
esp32doit-espduino.menu.UploadSpeed.512000.upload.speed=512000

esp32doit-espduino.menu.DebugLevel.none=None
esp32doit-espduino.menu.DebugLevel.none.build.code_debug=0
esp32doit-espduino.menu.DebugLevel.error=Error
esp32doit-espduino.menu.DebugLevel.error.build.code_debug=1
esp32doit-espduino.menu.DebugLevel.warn=Warn
esp32doit-espduino.menu.DebugLevel.warn.build.code_debug=2
esp32doit-espduino.menu.DebugLevel.info=Info
esp32doit-espduino.menu.DebugLevel.info.build.code_debug=3
esp32doit-espduino.menu.DebugLevel.debug=Debug
esp32doit-espduino.menu.DebugLevel.debug.build.code_debug=4
esp32doit-espduino.menu.DebugLevel.verbose=Verbose
esp32doit-espduino.menu.DebugLevel.verbose.build.code_debug=5

esp32doit-espduino.menu.EraseFlash.none=Disabled
esp32doit-espduino.menu.EraseFlash.none.upload.erase_cmd=
esp32doit-espduino.menu.EraseFlash.all=Enabled
esp32doit-espduino.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

esp32-evb.name=OLIMEX ESP32-EVB

esp32-evb.bootloader.tool=esptool_py
esp32-evb.bootloader.tool.default=esptool_py

esp32-evb.upload.tool=esptool_py
esp32-evb.upload.tool.default=esptool_py
esp32-evb.upload.tool.network=esp_ota

esp32-evb.upload.maximum_size=1310720
esp32-evb.upload.maximum_data_size=327680
esp32-evb.upload.flags=
esp32-evb.upload.extra_flags=

esp32-evb.serial.disableDTR=true
esp32-evb.serial.disableRTS=true

esp32-evb.build.tarch=xtensa
esp32-evb.build.bootloader_addr=0x1000
esp32-evb.build.target=esp32
esp32-evb.build.mcu=esp32
esp32-evb.build.core=esp32
esp32-evb.build.variant=esp32-evb
esp32-evb.build.board=ESP32_EVB

esp32-evb.build.f_cpu=240000000L
esp32-evb.build.flash_mode=dio
esp32-evb.build.flash_size=4MB
esp32-evb.build.boot=dio
esp32-evb.build.partitions=default
esp32-evb.build.defines=

esp32-evb.menu.FlashFreq.80=80MHz
esp32-evb.menu.FlashFreq.80.build.flash_freq=80m
esp32-evb.menu.FlashFreq.40=40MHz
esp32-evb.menu.FlashFreq.40.build.flash_freq=40m

esp32-evb.menu.UploadSpeed.921600=921600
esp32-evb.menu.UploadSpeed.921600.upload.speed=921600
esp32-evb.menu.UploadSpeed.115200=115200
esp32-evb.menu.UploadSpeed.115200.upload.speed=115200
esp32-evb.menu.UploadSpeed.256000.windows=256000
esp32-evb.menu.UploadSpeed.256000.upload.speed=256000
esp32-evb.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32-evb.menu.UploadSpeed.230400=230400
esp32-evb.menu.UploadSpeed.230400.upload.speed=230400
esp32-evb.menu.UploadSpeed.460800.linux=460800
esp32-evb.menu.UploadSpeed.460800.macosx=460800
esp32-evb.menu.UploadSpeed.460800.upload.speed=460800
esp32-evb.menu.UploadSpeed.512000.windows=512000
esp32-evb.menu.UploadSpeed.512000.upload.speed=512000

