byrmeng/arduino-esp32-core/boards.txt
##############################################################

esp32-devkitlipo.name=OLIMEX ESP32-DevKit-LiPo

esp32-devkitlipo.bootloader.tool=esptool_py
esp32-devkitlipo.bootloader.tool.default=esptool_py

esp32-devkitlipo.upload.tool=esptool_py
esp32-devkitlipo.upload.tool.default=esptool_py
esp32-devkitlipo.upload.tool.network=esp_ota

esp32-devkitlipo.upload.maximum_size=1310720
esp32-devkitlipo.upload.maximum_data_size=327680
esp32-devkitlipo.upload.flags=
esp32-devkitlipo.upload.extra_flags=

esp32-devkitlipo.serial.disableDTR=true
esp32-devkitlipo.serial.disableRTS=true

esp32-devkitlipo.build.tarch=xtensa
esp32-devkitlipo.build.bootloader_addr=0x1000
esp32-devkitlipo.build.target=esp32
esp32-devkitlipo.build.mcu=esp32
esp32-devkitlipo.build.core=esp32
esp32-devkitlipo.build.variant=esp32-devkit-lipo
esp32-devkitlipo.build.board=ESP32_DEVKIT_LIPO

esp32-devkitlipo.build.f_cpu=240000000L
esp32-devkitlipo.build.flash_size=4MB
esp32-devkitlipo.build.flash_freq=40m
esp32-devkitlipo.build.flash_mode=dio
esp32-devkitlipo.build.boot=dio
esp32-devkitlipo.build.partitions=default
esp32-devkitlipo.build.defines=

esp32-devkitlipo.menu.PSRAM.disabled=Disabled (WROOM)
esp32-devkitlipo.menu.PSRAM.disabled.build.defines=
esp32-devkitlipo.menu.PSRAM.disabled.build.extra_libs=
esp32-devkitlipo.menu.PSRAM.enabled=Enabled (WROVER)
esp32-devkitlipo.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
esp32-devkitlipo.menu.PSRAM.enabled.build.extra_libs=

esp32-devkitlipo.menu.PartitionScheme.default=Default
esp32-devkitlipo.menu.PartitionScheme.default.build.partitions=default
esp32-devkitlipo.menu.PartitionScheme.minimal=Minimal (2MB FLASH)
esp32-devkitlipo.menu.PartitionScheme.minimal.build.partitions=minimal
esp32-devkitlipo.menu.PartitionScheme.no_ota=No OTA (Large APP)
esp32-devkitlipo.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32-devkitlipo.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32-devkitlipo.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA)
esp32-devkitlipo.menu.PartitionScheme.huge_app.build.partitions=huge_app
esp32-devkitlipo.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
esp32-devkitlipo.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
esp32-devkitlipo.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32-devkitlipo.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
esp32-devkitlipo.menu.PartitionScheme.fatflash=16M Fat
esp32-devkitlipo.menu.PartitionScheme.fatflash.build.partitions=ffat

esp32-devkitlipo.menu.FlashMode.qio=QIO
esp32-devkitlipo.menu.FlashMode.qio.build.flash_mode=dio
esp32-devkitlipo.menu.FlashMode.qio.build.boot=qio
esp32-devkitlipo.menu.FlashMode.dio=DIO
esp32-devkitlipo.menu.FlashMode.dio.build.flash_mode=dio
esp32-devkitlipo.menu.FlashMode.dio.build.boot=dio

esp32-devkitlipo.menu.FlashFreq.80=80MHz
esp32-devkitlipo.menu.FlashFreq.80.build.flash_freq=80m
esp32-devkitlipo.menu.FlashFreq.40=40MHz
esp32-devkitlipo.menu.FlashFreq.40.build.flash_freq=40m

esp32-devkitlipo.menu.UploadSpeed.921600=921600
esp32-devkitlipo.menu.UploadSpeed.921600.upload.speed=921600
esp32-devkitlipo.menu.UploadSpeed.115200=115200
esp32-devkitlipo.menu.UploadSpeed.115200.upload.speed=115200
esp32-devkitlipo.menu.UploadSpeed.256000.windows=256000
esp32-devkitlipo.menu.UploadSpeed.256000.upload.speed=256000
esp32-devkitlipo.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32-devkitlipo.menu.UploadSpeed.230400=230400
esp32-devkitlipo.menu.UploadSpeed.230400.upload.speed=230400
esp32-devkitlipo.menu.UploadSpeed.460800.linux=460800
esp32-devkitlipo.menu.UploadSpeed.460800.macosx=460800
esp32-devkitlipo.menu.UploadSpeed.460800.upload.speed=460800
esp32-devkitlipo.menu.UploadSpeed.512000.windows=512000
esp32-devkitlipo.menu.UploadSpeed.512000.upload.speed=512000

esp32-devkitlipo.menu.DebugLevel.none=None
esp32-devkitlipo.menu.DebugLevel.none.build.code_debug=0
esp32-devkitlipo.menu.DebugLevel.error=Error
esp32-devkitlipo.menu.DebugLevel.error.build.code_debug=1
esp32-devkitlipo.menu.DebugLevel.warn=Warn
esp32-devkitlipo.menu.DebugLevel.warn.build.code_debug=2
esp32-devkitlipo.menu.DebugLevel.info=Info
esp32-devkitlipo.menu.DebugLevel.info.build.code_debug=3
esp32-devkitlipo.menu.DebugLevel.debug=Debug
esp32-devkitlipo.menu.DebugLevel.debug.build.code_debug=4
esp32-devkitlipo.menu.DebugLevel.verbose=Verbose
esp32-devkitlipo.menu.DebugLevel.verbose.build.code_debug=5

esp32-devkitlipo.menu.EraseFlash.none=Disabled
esp32-devkitlipo.menu.EraseFlash.none.upload.erase_cmd=
esp32-devkitlipo.menu.EraseFlash.all=Enabled
esp32-devkitlipo.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

esp32s2-devkitlipo.name=OLIMEX ESP32-S2-DevKit-Lipo

esp32s2-devkitlipo.bootloader.tool=esptool_py
esp32s2-devkitlipo.bootloader.tool.default=esptool_py

esp32s2-devkitlipo.upload.tool=esptool_py
esp32s2-devkitlipo.upload.tool.default=esptool_py
esp32s2-devkitlipo.upload.tool.network=esp_ota

esp32s2-devkitlipo.upload.maximum_size=1310720
esp32s2-devkitlipo.upload.maximum_data_size=327680
esp32s2-devkitlipo.upload.flags=
esp32s2-devkitlipo.upload.extra_flags=
esp32s2-devkitlipo.upload.use_1200bps_touch=false
esp32s2-devkitlipo.upload.wait_for_upload_port=false

esp32s2-devkitlipo.serial.disableDTR=false
esp32s2-devkitlipo.serial.disableRTS=false

esp32s2-devkitlipo.build.tarch=xtensa
esp32s2-devkitlipo.build.bootloader_addr=0x1000
esp32s2-devkitlipo.build.target=esp32s2
esp32s2-devkitlipo.build.mcu=esp32s2
esp32s2-devkitlipo.build.core=esp32
esp32s2-devkitlipo.build.variant=esp32s2-devkit-lipo
esp32s2-devkitlipo.build.board=ESP32S2_DEVKIT_LIPO

esp32s2-devkitlipo.build.cdc_on_boot=0
esp32s2-devkitlipo.build.msc_on_boot=0
esp32s2-devkitlipo.build.dfu_on_boot=0
esp32s2-devkitlipo.build.f_cpu=240000000L
esp32s2-devkitlipo.build.flash_size=4MB
esp32s2-devkitlipo.build.flash_freq=80m
esp32s2-devkitlipo.build.flash_mode=dio
esp32s2-devkitlipo.build.boot=qio
esp32s2-devkitlipo.build.partitions=default
esp32s2-devkitlipo.build.defines=

