byrmeng/arduino-esp32-core/boards.txt
esp32h2-devkitlipo.menu.FlashMode.qio=QIO
esp32h2-devkitlipo.menu.FlashMode.qio.build.flash_mode=dio
esp32h2-devkitlipo.menu.FlashMode.qio.build.boot=qio
esp32h2-devkitlipo.menu.FlashMode.dio=DIO
esp32h2-devkitlipo.menu.FlashMode.dio.build.flash_mode=dio
esp32h2-devkitlipo.menu.FlashMode.dio.build.boot=dio

esp32h2-devkitlipo.menu.FlashFreq.64=64MHz
esp32h2-devkitlipo.menu.FlashFreq.64.build.flash_freq=64m
esp32h2-devkitlipo.menu.FlashFreq.64.build.img_freq=48m
#esp32h-devkitlipo2.menu.FlashFreq.32=32MHz
#esp32h-devkitlipo2.menu.FlashFreq.32.build.flash_freq=32m
#esp32h-devkitlipo2.menu.FlashFreq.32.build.img_freq=24m
esp32h2-devkitlipo.menu.FlashFreq.16=16MHz
esp32h2-devkitlipo.menu.FlashFreq.16.build.flash_freq=16m
esp32h2-devkitlipo.menu.FlashFreq.16.build.img_freq=12m

esp32h2-devkitlipo.menu.FlashSize.4M=4MB (32Mb)
esp32h2-devkitlipo.menu.FlashSize.4M.build.flash_size=4MB
esp32h2-devkitlipo.menu.FlashSize.8M=8MB (64Mb)
esp32h2-devkitlipo.menu.FlashSize.8M.build.flash_size=8MB
esp32h2-devkitlipo.menu.FlashSize.2M=2MB (16Mb)
esp32h2-devkitlipo.menu.FlashSize.2M.build.flash_size=2MB
esp32h2-devkitlipo.menu.FlashSize.16M=16MB (128Mb)
esp32h2-devkitlipo.menu.FlashSize.16M.build.flash_size=16MB

esp32h2-devkitlipo.menu.UploadSpeed.921600=921600
esp32h2-devkitlipo.menu.UploadSpeed.921600.upload.speed=921600
esp32h2-devkitlipo.menu.UploadSpeed.115200=115200
esp32h2-devkitlipo.menu.UploadSpeed.115200.upload.speed=115200
esp32h2-devkitlipo.menu.UploadSpeed.256000.windows=256000
esp32h2-devkitlipo.menu.UploadSpeed.256000.upload.speed=256000
esp32h2-devkitlipo.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32h2-devkitlipo.menu.UploadSpeed.230400=230400
esp32h2-devkitlipo.menu.UploadSpeed.230400.upload.speed=230400
esp32h2-devkitlipo.menu.UploadSpeed.460800.linux=460800
esp32h2-devkitlipo.menu.UploadSpeed.460800.macosx=460800
esp32h2-devkitlipo.menu.UploadSpeed.460800.upload.speed=460800
esp32h2-devkitlipo.menu.UploadSpeed.512000.windows=512000
esp32h2-devkitlipo.menu.UploadSpeed.512000.upload.speed=512000

esp32h2-devkitlipo.menu.DebugLevel.none=None
esp32h2-devkitlipo.menu.DebugLevel.none.build.code_debug=0
esp32h2-devkitlipo.menu.DebugLevel.error=Error
esp32h2-devkitlipo.menu.DebugLevel.error.build.code_debug=1
esp32h2-devkitlipo.menu.DebugLevel.warn=Warn
esp32h2-devkitlipo.menu.DebugLevel.warn.build.code_debug=2
esp32h2-devkitlipo.menu.DebugLevel.info=Info
esp32h2-devkitlipo.menu.DebugLevel.info.build.code_debug=3
esp32h2-devkitlipo.menu.DebugLevel.debug=Debug
esp32h2-devkitlipo.menu.DebugLevel.debug.build.code_debug=4
esp32h2-devkitlipo.menu.DebugLevel.verbose=Verbose
esp32h2-devkitlipo.menu.DebugLevel.verbose.build.code_debug=5

esp32h2-devkitlipo.menu.EraseFlash.none=Disabled
esp32h2-devkitlipo.menu.EraseFlash.none.upload.erase_cmd=
esp32h2-devkitlipo.menu.EraseFlash.all=Enabled
esp32h2-devkitlipo.menu.EraseFlash.all.upload.erase_cmd=-e

esp32h2-devkitlipo.menu.ZigbeeMode.default=Disabled
esp32h2-devkitlipo.menu.ZigbeeMode.default.build.zigbee_mode=
esp32h2-devkitlipo.menu.ZigbeeMode.default.build.zigbee_libs=
esp32h2-devkitlipo.menu.ZigbeeMode.ed=Zigbee ED (end device)
esp32h2-devkitlipo.menu.ZigbeeMode.ed.build.zigbee_mode=-DZIGBEE_MODE_ED
esp32h2-devkitlipo.menu.ZigbeeMode.ed.build.zigbee_libs=-lesp_zb_api.ed -lzboss_stack.ed -lzboss_port.native
esp32h2-devkitlipo.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
esp32h2-devkitlipo.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
esp32h2-devkitlipo.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.native

##############################################################

esp32-sbc-fabgl.name=OLIMEX ESP32-SBC-FABGL

esp32-sbc-fabgl.bootloader.tool=esptool_py
esp32-sbc-fabgl.bootloader.tool.default=esptool_py

esp32-sbc-fabgl.upload.tool=esptool_py
esp32-sbc-fabgl.upload.tool.default=esptool_py
esp32-sbc-fabgl.upload.tool.network=esp_ota

esp32-sbc-fabgl.upload.maximum_size=1310720
esp32-sbc-fabgl.upload.maximum_data_size=327680
esp32-sbc-fabgl.upload.flags=
esp32-sbc-fabgl.upload.extra_flags=

esp32-sbc-fabgl.serial.disableDTR=true
esp32-sbc-fabgl.serial.disableRTS=true

esp32-sbc-fabgl.build.tarch=xtensa
esp32-sbc-fabgl.build.bootloader_addr=0x1000
esp32-sbc-fabgl.build.target=esp32
esp32-sbc-fabgl.build.mcu=esp32
esp32-sbc-fabgl.build.core=esp32
esp32-sbc-fabgl.build.variant=esp32-sbc-fabgl
esp32-sbc-fabgl.build.board=ESP32_SBC_FABGL

esp32-sbc-fabgl.build.f_cpu=240000000L
esp32-sbc-fabgl.build.flash_size=4MB
esp32-sbc-fabgl.build.flash_freq=40m
esp32-sbc-fabgl.build.flash_mode=dio
esp32-sbc-fabgl.build.boot=dio
esp32-sbc-fabgl.build.partitions=default
esp32-sbc-fabgl.build.defines=
esp32-sbc-fabgl.build.loop_core=
esp32-sbc-fabgl.build.event_core=

## IDE 2.0 Seems to not update the value
esp32-sbc-fabgl.menu.JTAGAdapter.default=Disabled
esp32-sbc-fabgl.menu.JTAGAdapter.default.build.copy_jtag_files=0
esp32-sbc-fabgl.menu.JTAGAdapter.external=FTDI Adapter
esp32-sbc-fabgl.menu.JTAGAdapter.external.build.openocdscript=esp32-wrover-kit-3.3v.cfg
esp32-sbc-fabgl.menu.JTAGAdapter.external.build.copy_jtag_files=1
esp32-sbc-fabgl.menu.JTAGAdapter.bridge=ESP USB Bridge
esp32-sbc-fabgl.menu.JTAGAdapter.bridge.build.openocdscript=esp32-bridge.cfg
esp32-sbc-fabgl.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

esp32-sbc-fabgl.menu.PSRAM.enabled=Enabled
esp32-sbc-fabgl.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
esp32-sbc-fabgl.menu.PSRAM.enabled.build.extra_libs=
esp32-sbc-fabgl.menu.PSRAM.disabled=Disabled
esp32-sbc-fabgl.menu.PSRAM.disabled.build.defines=
esp32-sbc-fabgl.menu.PSRAM.disabled.build.extra_libs=

esp32-sbc-fabgl.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
esp32-sbc-fabgl.menu.PartitionScheme.default.build.partitions=default
esp32-sbc-fabgl.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
esp32-sbc-fabgl.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
esp32-sbc-fabgl.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
esp32-sbc-fabgl.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
esp32-sbc-fabgl.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
esp32-sbc-fabgl.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
esp32-sbc-fabgl.menu.PartitionScheme.minimal.build.partitions=minimal
esp32-sbc-fabgl.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
esp32-sbc-fabgl.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32-sbc-fabgl.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32-sbc-fabgl.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
esp32-sbc-fabgl.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
esp32-sbc-fabgl.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
esp32-sbc-fabgl.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
esp32-sbc-fabgl.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
esp32-sbc-fabgl.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
esp32-sbc-fabgl.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
esp32-sbc-fabgl.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
esp32-sbc-fabgl.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
esp32-sbc-fabgl.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
esp32-sbc-fabgl.menu.PartitionScheme.huge_app.build.partitions=huge_app
esp32-sbc-fabgl.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
esp32-sbc-fabgl.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
esp32-sbc-fabgl.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32-sbc-fabgl.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
esp32-sbc-fabgl.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
esp32-sbc-fabgl.menu.PartitionScheme.fatflash.build.partitions=ffat
esp32-sbc-fabgl.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
esp32-sbc-fabgl.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
esp32-sbc-fabgl.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
esp32-sbc-fabgl.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
esp32-sbc-fabgl.menu.PartitionScheme.rainmaker=RainMaker 4MB
esp32-sbc-fabgl.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
esp32-sbc-fabgl.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
esp32-sbc-fabgl.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
esp32-sbc-fabgl.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
esp32-sbc-fabgl.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
esp32-sbc-fabgl.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
esp32-sbc-fabgl.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
esp32-sbc-fabgl.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4116480
esp32-sbc-fabgl.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
esp32-sbc-fabgl.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
esp32-sbc-fabgl.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
esp32-sbc-fabgl.menu.PartitionScheme.custom=Custom
esp32-sbc-fabgl.menu.PartitionScheme.custom.build.partitions=
esp32-sbc-fabgl.menu.PartitionScheme.custom.upload.maximum_size=16777216

esp32-sbc-fabgl.menu.CPUFreq.240=240MHz (WiFi/BT)
esp32-sbc-fabgl.menu.CPUFreq.240.build.f_cpu=240000000L
esp32-sbc-fabgl.menu.CPUFreq.160=160MHz (WiFi/BT)
esp32-sbc-fabgl.menu.CPUFreq.160.build.f_cpu=160000000L
esp32-sbc-fabgl.menu.CPUFreq.80=80MHz (WiFi/BT)
esp32-sbc-fabgl.menu.CPUFreq.80.build.f_cpu=80000000L
esp32-sbc-fabgl.menu.CPUFreq.40=40MHz (40MHz XTAL)
esp32-sbc-fabgl.menu.CPUFreq.40.build.f_cpu=40000000L
esp32-sbc-fabgl.menu.CPUFreq.26=26MHz (26MHz XTAL)
esp32-sbc-fabgl.menu.CPUFreq.26.build.f_cpu=26000000L
esp32-sbc-fabgl.menu.CPUFreq.20=20MHz (40MHz XTAL)
esp32-sbc-fabgl.menu.CPUFreq.20.build.f_cpu=20000000L
esp32-sbc-fabgl.menu.CPUFreq.13=13MHz (26MHz XTAL)
esp32-sbc-fabgl.menu.CPUFreq.13.build.f_cpu=13000000L
esp32-sbc-fabgl.menu.CPUFreq.10=10MHz (40MHz XTAL)
esp32-sbc-fabgl.menu.CPUFreq.10.build.f_cpu=10000000L

esp32-sbc-fabgl.menu.FlashMode.qio=QIO
esp32-sbc-fabgl.menu.FlashMode.qio.build.flash_mode=dio
esp32-sbc-fabgl.menu.FlashMode.qio.build.boot=qio
esp32-sbc-fabgl.menu.FlashMode.dio=DIO
esp32-sbc-fabgl.menu.FlashMode.dio.build.flash_mode=dio
esp32-sbc-fabgl.menu.FlashMode.dio.build.boot=dio

