byrmeng/arduino-esp32-core/boards.txt
##############################################################

m5stack_station.name=M5Station

m5stack_station.bootloader.tool=esptool_py
m5stack_station.bootloader.tool.default=esptool_py

m5stack_station.upload.tool=esptool_py
m5stack_station.upload.tool.default=esptool_py
m5stack_station.upload.tool.network=esp_ota

m5stack_station.upload.maximum_size=6553600
m5stack_station.upload.maximum_data_size=4521984
m5stack_station.upload.flags=
m5stack_station.upload.extra_flags=

m5stack_station.serial.disableDTR=true
m5stack_station.serial.disableRTS=true

m5stack_station.build.tarch=xtensa
m5stack_station.build.bootloader_addr=0x1000
m5stack_station.build.target=esp32
m5stack_station.build.mcu=esp32
m5stack_station.build.core=esp32
m5stack_station.build.variant=m5stack_station
m5stack_station.build.board=M5STACK_STATION

m5stack_station.build.f_cpu=240000000L
m5stack_station.build.flash_size=16MB
m5stack_station.build.flash_freq=80m
m5stack_station.build.flash_mode=dio
m5stack_station.build.boot=dio
m5stack_station.build.partitions=default
m5stack_station.build.defines=
m5stack_station.build.loop_core=
m5stack_station.build.event_core=

m5stack_station.menu.PartitionScheme.default=Default (2 x 6.5 MB app, 3.6 MB SPIFFS)
m5stack_station.menu.PartitionScheme.default.build.partitions=default_16MB
m5stack_station.menu.PartitionScheme.default.upload.maximum_size=6553600
m5stack_station.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
m5stack_station.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
m5stack_station.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
m5stack_station.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
m5stack_station.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
m5stack_station.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
m5stack_station.menu.PartitionScheme.minimal.build.partitions=minimal
m5stack_station.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
m5stack_station.menu.PartitionScheme.no_ota.build.partitions=no_ota
m5stack_station.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
m5stack_station.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
m5stack_station.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
m5stack_station.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
m5stack_station.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
m5stack_station.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
m5stack_station.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
m5stack_station.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
m5stack_station.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
m5stack_station.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
m5stack_station.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
m5stack_station.menu.PartitionScheme.huge_app.build.partitions=huge_app
m5stack_station.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
m5stack_station.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
m5stack_station.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
m5stack_station.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
m5stack_station.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
m5stack_station.menu.PartitionScheme.fatflash.build.partitions=ffat
m5stack_station.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
m5stack_station.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
m5stack_station.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
m5stack_station.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
m5stack_station.menu.PartitionScheme.rainmaker=RainMaker 4MB
m5stack_station.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
m5stack_station.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
m5stack_station.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
m5stack_station.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
m5stack_station.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
m5stack_station.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
m5stack_station.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
m5stack_station.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4116480
m5stack_station.menu.PartitionScheme.custom=Custom
m5stack_station.menu.PartitionScheme.custom.build.partitions=
m5stack_station.menu.PartitionScheme.custom.upload.maximum_size=16777216

m5stack_station.menu.CPUFreq.240=240MHz (WiFi/BT)
m5stack_station.menu.CPUFreq.240.build.f_cpu=240000000L
m5stack_station.menu.CPUFreq.160=160MHz (WiFi/BT)
m5stack_station.menu.CPUFreq.160.build.f_cpu=160000000L
m5stack_station.menu.CPUFreq.80=80MHz (WiFi/BT)
m5stack_station.menu.CPUFreq.80.build.f_cpu=80000000L
m5stack_station.menu.CPUFreq.40=40MHz (40MHz XTAL)
m5stack_station.menu.CPUFreq.40.build.f_cpu=40000000L
m5stack_station.menu.CPUFreq.26=26MHz (26MHz XTAL)
m5stack_station.menu.CPUFreq.26.build.f_cpu=26000000L
m5stack_station.menu.CPUFreq.20=20MHz (40MHz XTAL)
m5stack_station.menu.CPUFreq.20.build.f_cpu=20000000L
m5stack_station.menu.CPUFreq.13=13MHz (26MHz XTAL)
m5stack_station.menu.CPUFreq.13.build.f_cpu=13000000L
m5stack_station.menu.CPUFreq.10=10MHz (40MHz XTAL)
m5stack_station.menu.CPUFreq.10.build.f_cpu=10000000L

m5stack_station.menu.FlashMode.qio=QIO
m5stack_station.menu.FlashMode.qio.build.flash_mode=dio
m5stack_station.menu.FlashMode.qio.build.boot=qio
m5stack_station.menu.FlashMode.dio=DIO
m5stack_station.menu.FlashMode.dio.build.flash_mode=dio
m5stack_station.menu.FlashMode.dio.build.boot=dio
m5stack_station.menu.FlashMode.qout=QOUT
m5stack_station.menu.FlashMode.qout.build.flash_mode=dout
m5stack_station.menu.FlashMode.qout.build.boot=qout
m5stack_station.menu.FlashMode.dout=DOUT
m5stack_station.menu.FlashMode.dout.build.flash_mode=dout
m5stack_station.menu.FlashMode.dout.build.boot=dout

m5stack_station.menu.FlashFreq.80=80MHz
m5stack_station.menu.FlashFreq.80.build.flash_freq=80m
m5stack_station.menu.FlashFreq.40=40MHz
m5stack_station.menu.FlashFreq.40.build.flash_freq=40m

m5stack_station.menu.FlashSize.16M=16MB (128Mb)
m5stack_station.menu.FlashSize.16M.build.flash_size=16MB

m5stack_station.menu.UploadSpeed.1500000=1500000
m5stack_station.menu.UploadSpeed.1500000.upload.speed=1500000
m5stack_station.menu.UploadSpeed.921600=921600
m5stack_station.menu.UploadSpeed.921600.upload.speed=921600
m5stack_station.menu.UploadSpeed.115200=115200
m5stack_station.menu.UploadSpeed.115200.upload.speed=115200
m5stack_station.menu.UploadSpeed.256000.windows=256000
m5stack_station.menu.UploadSpeed.256000.upload.speed=256000
m5stack_station.menu.UploadSpeed.230400.windows.upload.speed=256000
m5stack_station.menu.UploadSpeed.230400=230400
m5stack_station.menu.UploadSpeed.230400.upload.speed=230400
m5stack_station.menu.UploadSpeed.460800.linux=460800
m5stack_station.menu.UploadSpeed.460800.macosx=460800
m5stack_station.menu.UploadSpeed.460800.upload.speed=460800
m5stack_station.menu.UploadSpeed.512000.windows=512000
m5stack_station.menu.UploadSpeed.512000.upload.speed=512000

m5stack_station.menu.LoopCore.1=Core 1
m5stack_station.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
m5stack_station.menu.LoopCore.0=Core 0
m5stack_station.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

m5stack_station.menu.EventsCore.1=Core 1
m5stack_station.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
m5stack_station.menu.EventsCore.0=Core 0
m5stack_station.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

m5stack_station.menu.DebugLevel.none=None
m5stack_station.menu.DebugLevel.none.build.code_debug=0
m5stack_station.menu.DebugLevel.error=Error
m5stack_station.menu.DebugLevel.error.build.code_debug=1
m5stack_station.menu.DebugLevel.warn=Warn
m5stack_station.menu.DebugLevel.warn.build.code_debug=2
m5stack_station.menu.DebugLevel.info=Info
m5stack_station.menu.DebugLevel.info.build.code_debug=3
m5stack_station.menu.DebugLevel.debug=Debug
m5stack_station.menu.DebugLevel.debug.build.code_debug=4
m5stack_station.menu.DebugLevel.verbose=Verbose
m5stack_station.menu.DebugLevel.verbose.build.code_debug=5

m5stack_station.menu.EraseFlash.none=Disabled
m5stack_station.menu.EraseFlash.none.upload.erase_cmd=
m5stack_station.menu.EraseFlash.all=Enabled
m5stack_station.menu.EraseFlash.all.upload.erase_cmd=-e

