byrmeng/arduino-esp32-core/boards.txt
m5stack_stickc_plus.menu.UploadSpeed.1500000=1500000
m5stack_stickc_plus.menu.UploadSpeed.1500000.upload.speed=1500000
m5stack_stickc_plus.menu.UploadSpeed.750000=750000
m5stack_stickc_plus.menu.UploadSpeed.750000.upload.speed=750000
m5stack_stickc_plus.menu.UploadSpeed.500000=500000
m5stack_stickc_plus.menu.UploadSpeed.500000.upload.speed=500000
m5stack_stickc_plus.menu.UploadSpeed.250000=250000
m5stack_stickc_plus.menu.UploadSpeed.250000.upload.speed=250000
m5stack_stickc_plus.menu.UploadSpeed.115200=115200
m5stack_stickc_plus.menu.UploadSpeed.115200.upload.speed=115200

m5stack_stickc_plus.menu.LoopCore.1=Core 1
m5stack_stickc_plus.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
m5stack_stickc_plus.menu.LoopCore.0=Core 0
m5stack_stickc_plus.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

m5stack_stickc_plus.menu.EventsCore.1=Core 1
m5stack_stickc_plus.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
m5stack_stickc_plus.menu.EventsCore.0=Core 0
m5stack_stickc_plus.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

m5stack_stickc_plus.menu.DebugLevel.none=None
m5stack_stickc_plus.menu.DebugLevel.none.build.code_debug=0
m5stack_stickc_plus.menu.DebugLevel.error=Error
m5stack_stickc_plus.menu.DebugLevel.error.build.code_debug=1
m5stack_stickc_plus.menu.DebugLevel.warn=Warn
m5stack_stickc_plus.menu.DebugLevel.warn.build.code_debug=2
m5stack_stickc_plus.menu.DebugLevel.info=Info
m5stack_stickc_plus.menu.DebugLevel.info.build.code_debug=3
m5stack_stickc_plus.menu.DebugLevel.debug=Debug
m5stack_stickc_plus.menu.DebugLevel.debug.build.code_debug=4
m5stack_stickc_plus.menu.DebugLevel.verbose=Verbose
m5stack_stickc_plus.menu.DebugLevel.verbose.build.code_debug=5

m5stack_stickc_plus.menu.EraseFlash.none=Disabled
m5stack_stickc_plus.menu.EraseFlash.none.upload.erase_cmd=
m5stack_stickc_plus.menu.EraseFlash.all=Enabled
m5stack_stickc_plus.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

m5stack_stickc_plus2.name=M5StickCPlus2

m5stack_stickc_plus2.bootloader.tool=esptool_py
m5stack_stickc_plus2.bootloader.tool.default=esptool_py

m5stack_stickc_plus2.upload.tool=esptool_py
m5stack_stickc_plus2.upload.tool.default=esptool_py
m5stack_stickc_plus2.upload.tool.network=esp_ota

m5stack_stickc_plus2.upload.maximum_size=3342336
m5stack_stickc_plus2.upload.maximum_data_size=327680
m5stack_stickc_plus2.upload.flags=
m5stack_stickc_plus2.upload.extra_flags=

m5stack_stickc_plus2.serial.disableDTR=true
m5stack_stickc_plus2.serial.disableRTS=true

m5stack_stickc_plus2.build.tarch=xtensa
m5stack_stickc_plus2.build.bootloader_addr=0x1000
m5stack_stickc_plus2.build.target=esp32
m5stack_stickc_plus2.build.mcu=esp32
m5stack_stickc_plus2.build.core=esp32
m5stack_stickc_plus2.build.variant=m5stack_stickc_plus2
m5stack_stickc_plus2.build.board=M5STACK_STICKC_PLUS2

m5stack_stickc_plus2.build.f_cpu=240000000L
m5stack_stickc_plus2.build.flash_size=8MB
m5stack_stickc_plus2.build.flash_freq=80m
m5stack_stickc_plus2.build.flash_mode=dio
m5stack_stickc_plus2.build.boot=dio
m5stack_stickc_plus2.build.partitions=default_8MB
m5stack_stickc_plus2.build.defines=
m5stack_stickc_plus2.build.loop_core=
m5stack_stickc_plus2.build.event_core=

m5stack_stickc_plus2.menu.PSRAM.enabled=Enabled
m5stack_stickc_plus2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
m5stack_stickc_plus2.menu.PSRAM.enabled.build.extra_libs=
m5stack_stickc_plus2.menu.PSRAM.disabled=Disabled
m5stack_stickc_plus2.menu.PSRAM.disabled.build.defines=
m5stack_stickc_plus2.menu.PSRAM.disabled.build.extra_libs=

m5stack_stickc_plus2.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
m5stack_stickc_plus2.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
m5stack_stickc_plus2.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
m5stack_stickc_plus2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
m5stack_stickc_plus2.menu.PartitionScheme.huge_app.build.partitions=huge_app
m5stack_stickc_plus2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
m5stack_stickc_plus2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
m5stack_stickc_plus2.menu.PartitionScheme.default.build.partitions=default
m5stack_stickc_plus2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
m5stack_stickc_plus2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
m5stack_stickc_plus2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
m5stack_stickc_plus2.menu.PartitionScheme.minimal.build.partitions=minimal
m5stack_stickc_plus2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
m5stack_stickc_plus2.menu.PartitionScheme.no_ota.build.partitions=no_ota
m5stack_stickc_plus2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
m5stack_stickc_plus2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
m5stack_stickc_plus2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
m5stack_stickc_plus2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
m5stack_stickc_plus2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
m5stack_stickc_plus2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
m5stack_stickc_plus2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
m5stack_stickc_plus2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
m5stack_stickc_plus2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
m5stack_stickc_plus2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
m5stack_stickc_plus2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
m5stack_stickc_plus2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
m5stack_stickc_plus2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
m5stack_stickc_plus2.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
m5stack_stickc_plus2.menu.PartitionScheme.fatflash.build.partitions=ffat
m5stack_stickc_plus2.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
m5stack_stickc_plus2.menu.PartitionScheme.rainmaker=RainMaker 4MB
m5stack_stickc_plus2.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
m5stack_stickc_plus2.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
m5stack_stickc_plus2.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
m5stack_stickc_plus2.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
m5stack_stickc_plus2.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
m5stack_stickc_plus2.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
m5stack_stickc_plus2.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
m5stack_stickc_plus2.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4116480
m5stack_stickc_plus2.menu.PartitionScheme.custom=Custom
m5stack_stickc_plus2.menu.PartitionScheme.custom.build.partitions=
m5stack_stickc_plus2.menu.PartitionScheme.custom.upload.maximum_size=16777216

