byrmeng/arduino-esp32-core/boards.txt
m5stack_unit_cam.menu.EventsCore.1=Core 1
m5stack_unit_cam.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
m5stack_unit_cam.menu.EventsCore.0=Core 0
m5stack_unit_cam.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

m5stack_unit_cam.menu.DebugLevel.none=None
m5stack_unit_cam.menu.DebugLevel.none.build.code_debug=0
m5stack_unit_cam.menu.DebugLevel.error=Error
m5stack_unit_cam.menu.DebugLevel.error.build.code_debug=1
m5stack_unit_cam.menu.DebugLevel.warn=Warn
m5stack_unit_cam.menu.DebugLevel.warn.build.code_debug=2
m5stack_unit_cam.menu.DebugLevel.info=Info
m5stack_unit_cam.menu.DebugLevel.info.build.code_debug=3
m5stack_unit_cam.menu.DebugLevel.debug=Debug
m5stack_unit_cam.menu.DebugLevel.debug.build.code_debug=4
m5stack_unit_cam.menu.DebugLevel.verbose=Verbose
m5stack_unit_cam.menu.DebugLevel.verbose.build.code_debug=5

m5stack_unit_cam.menu.EraseFlash.none=Disabled
m5stack_unit_cam.menu.EraseFlash.none.upload.erase_cmd=
m5stack_unit_cam.menu.EraseFlash.all=Enabled
m5stack_unit_cam.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################


m5stack_unit_cams3.name=M5UnitCAMS3
m5stack_unit_cams3.bootloader.tool=esptool_py
m5stack_unit_cams3.bootloader.tool.default=esptool_py

m5stack_unit_cams3.upload.tool=esptool_py
m5stack_unit_cams3.upload.tool.default=esptool_py
m5stack_unit_cams3.upload.tool.network=esp_ota

m5stack_unit_cams3.upload.maximum_size=1310720
m5stack_unit_cams3.upload.maximum_data_size=327680
m5stack_unit_cams3.upload.flags=
m5stack_unit_cams3.upload.extra_flags=
m5stack_unit_cams3.upload.use_1200bps_touch=false
m5stack_unit_cams3.upload.wait_for_upload_port=false

m5stack_unit_cams3.serial.disableDTR=false
m5stack_unit_cams3.serial.disableRTS=false

m5stack_unit_cams3.build.tarch=xtensa
m5stack_unit_cams3.build.bootloader_addr=0x0
m5stack_unit_cams3.build.target=esp32s3
m5stack_unit_cams3.build.mcu=esp32s3
m5stack_unit_cams3.build.core=esp32
m5stack_unit_cams3.build.variant=m5stack_unit_cams3
m5stack_unit_cams3.build.board=M5STACK_UNIT_CAMS3

m5stack_unit_cams3.build.usb_mode=1
m5stack_unit_cams3.build.cdc_on_boot=1
m5stack_unit_cams3.build.msc_on_boot=0
m5stack_unit_cams3.build.dfu_on_boot=0
m5stack_unit_cams3.build.f_cpu=240000000L
m5stack_unit_cams3.build.flash_size=16MB
m5stack_unit_cams3.build.flash_freq=80m
m5stack_unit_cams3.build.flash_mode=dio
m5stack_unit_cams3.build.boot=qio
m5stack_unit_cams3.build.boot_freq=80m
m5stack_unit_cams3.build.partitions=default
m5stack_unit_cams3.build.defines=
m5stack_unit_cams3.build.loop_core=
m5stack_unit_cams3.build.event_core=
m5stack_unit_cams3.build.psram_type=qspi
m5stack_unit_cams3.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
m5stack_unit_cams3.menu.JTAGAdapter.default=Disabled
m5stack_unit_cams3.menu.JTAGAdapter.default.build.copy_jtag_files=0
m5stack_unit_cams3.menu.JTAGAdapter.builtin=Integrated USB JTAG
m5stack_unit_cams3.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
m5stack_unit_cams3.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
m5stack_unit_cams3.menu.JTAGAdapter.external=FTDI Adapter
m5stack_unit_cams3.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
m5stack_unit_cams3.menu.JTAGAdapter.external.build.copy_jtag_files=1
m5stack_unit_cams3.menu.JTAGAdapter.bridge=ESP USB Bridge
m5stack_unit_cams3.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
m5stack_unit_cams3.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

m5stack_unit_cams3.menu.PSRAM.enabled=QSPI PSRAM
m5stack_unit_cams3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
m5stack_unit_cams3.menu.PSRAM.enabled.build.psram_type=qspi
m5stack_unit_cams3.menu.PSRAM.disabled=Disabled
m5stack_unit_cams3.menu.PSRAM.disabled.build.defines=
m5stack_unit_cams3.menu.PSRAM.disabled.build.psram_type=qspi
m5stack_unit_cams3.menu.PSRAM.opi=OPI PSRAM
m5stack_unit_cams3.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
m5stack_unit_cams3.menu.PSRAM.opi.build.psram_type=opi

m5stack_unit_cams3.menu.FlashMode.qio=QIO 80MHz
m5stack_unit_cams3.menu.FlashMode.qio.build.flash_mode=dio
m5stack_unit_cams3.menu.FlashMode.qio.build.boot=qio
m5stack_unit_cams3.menu.FlashMode.qio.build.boot_freq=80m
m5stack_unit_cams3.menu.FlashMode.qio.build.flash_freq=80m
m5stack_unit_cams3.menu.FlashMode.qio120=QIO 120MHz
m5stack_unit_cams3.menu.FlashMode.qio120.build.flash_mode=dio
m5stack_unit_cams3.menu.FlashMode.qio120.build.boot=qio
m5stack_unit_cams3.menu.FlashMode.qio120.build.boot_freq=120m
m5stack_unit_cams3.menu.FlashMode.qio120.build.flash_freq=80m
m5stack_unit_cams3.menu.FlashMode.dio=DIO 80MHz
m5stack_unit_cams3.menu.FlashMode.dio.build.flash_mode=dio
m5stack_unit_cams3.menu.FlashMode.dio.build.boot=dio
m5stack_unit_cams3.menu.FlashMode.dio.build.boot_freq=80m
m5stack_unit_cams3.menu.FlashMode.dio.build.flash_freq=80m
m5stack_unit_cams3.menu.FlashMode.opi=OPI 80MHz
m5stack_unit_cams3.menu.FlashMode.opi.build.flash_mode=dout
m5stack_unit_cams3.menu.FlashMode.opi.build.boot=opi
m5stack_unit_cams3.menu.FlashMode.opi.build.boot_freq=80m
m5stack_unit_cams3.menu.FlashMode.opi.build.flash_freq=80m

m5stack_unit_cams3.menu.FlashSize.16M=16MB (128Mb)
m5stack_unit_cams3.menu.FlashSize.16M.build.flash_size=16MB
m5stack_unit_cams3.menu.FlashSize.32M=32MB (256Mb)
m5stack_unit_cams3.menu.FlashSize.32M.build.flash_size=32MB

m5stack_unit_cams3.menu.LoopCore.1=Core 1
m5stack_unit_cams3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
m5stack_unit_cams3.menu.LoopCore.0=Core 0
m5stack_unit_cams3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

m5stack_unit_cams3.menu.EventsCore.1=Core 1
m5stack_unit_cams3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
m5stack_unit_cams3.menu.EventsCore.0=Core 0
m5stack_unit_cams3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

m5stack_unit_cams3.menu.USBMode.hwcdc=Hardware CDC and JTAG
m5stack_unit_cams3.menu.USBMode.hwcdc.build.usb_mode=1
m5stack_unit_cams3.menu.USBMode.default=USB-OTG (TinyUSB)
m5stack_unit_cams3.menu.USBMode.default.build.usb_mode=0

m5stack_unit_cams3.menu.CDCOnBoot.cdc=Enabled
m5stack_unit_cams3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
m5stack_unit_cams3.menu.CDCOnBoot.default=Disabled
m5stack_unit_cams3.menu.CDCOnBoot.default.build.cdc_on_boot=0

