byrmeng/arduino-esp32-core/boards.txt
heltec_wireless_shell_V3.menu.LoRaWanDebugLevel.0=None
heltec_wireless_shell_V3.menu.LoRaWanDebugLevel.0.build.LoRaWanDebugLevel=0
heltec_wireless_shell_V3.menu.LoRaWanDebugLevel.1=Freq
heltec_wireless_shell_V3.menu.LoRaWanDebugLevel.1.build.LoRaWanDebugLevel=1
heltec_wireless_shell_V3.menu.LoRaWanDebugLevel.2=Freq && DIO
heltec_wireless_shell_V3.menu.LoRaWanDebugLevel.2.build.LoRaWanDebugLevel=2
heltec_wireless_shell_V3.menu.LoRaWanDebugLevel.3=Freq && DIO && PW
heltec_wireless_shell_V3.menu.LoRaWanDebugLevel.3.build.LoRaWanDebugLevel=3

heltec_wireless_shell_V3.menu.LORAWAN_DEVEUI.0=CUSTOM
heltec_wireless_shell_V3.menu.LORAWAN_DEVEUI.0.build.LORAWAN_DEVEUI_AUTO=0
heltec_wireless_shell_V3.menu.LORAWAN_DEVEUI.1=Generate By ChipID
heltec_wireless_shell_V3.menu.LORAWAN_DEVEUI.1.build.LORAWAN_DEVEUI_AUTO=1

heltec_wireless_shell_V3.menu.LORAWAN_PREAMBLE_LENGTH.0=8(default)
heltec_wireless_shell_V3.menu.LORAWAN_PREAMBLE_LENGTH.0.build.LORAWAN_PREAMBLE_LENGTH=8
heltec_wireless_shell_V3.menu.LORAWAN_PREAMBLE_LENGTH.1=16(For M00 and M00L)
heltec_wireless_shell_V3.menu.LORAWAN_PREAMBLE_LENGTH.1.build.LORAWAN_PREAMBLE_LENGTH=16

heltec_wireless_shell_V3.menu.SLOW_CLK_TPYE.0=Internal (default)
heltec_wireless_shell_V3.menu.SLOW_CLK_TPYE.0.build.SLOW_CLK_TPYE=0
heltec_wireless_shell_V3.menu.SLOW_CLK_TPYE.1=External 32K
heltec_wireless_shell_V3.menu.SLOW_CLK_TPYE.1.build.SLOW_CLK_TPYE=1

heltec_wireless_shell_V3.build.defines=-D{build.band} -DMCU_ESP32_S3 -DHELTEC_BOARD=33 -DWIRELESS_SHELL_V3 -DSLOW_CLK_TPYE={build.SLOW_CLK_TPYE} -DRADIO_CHIP_SX1262  -DLoRaWAN_DEBUG_LEVEL={build.LoRaWanDebugLevel} -DACTIVE_REGION=LORAMAC_{build.band} -DLORAWAN_PREAMBLE_LENGTH={build.LORAWAN_PREAMBLE_LENGTH} -DLORAWAN_DEVEUI_AUTO={build.LORAWAN_DEVEUI_AUTO} -D{build.board}

heltec_wireless_shell_V3.menu.EraseFlash.none=Disabled
heltec_wireless_shell_V3.menu.EraseFlash.none.upload.erase_cmd=
heltec_wireless_shell_V3.menu.EraseFlash.all=Enabled
heltec_wireless_shell_V3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

heltec_capsule_sensor_V3.name=Heltec Capsule Sensor (V3)

heltec_capsule_sensor_V3.bootloader.tool=esptool_py
heltec_capsule_sensor_V3.bootloader.tool.default=esptool_py

heltec_capsule_sensor_V3.upload.tool=esptool_py
heltec_capsule_sensor_V3.upload.tool.default=esptool_py
heltec_capsule_sensor_V3.upload.tool.network=esp_ota

heltec_capsule_sensor_V3.upload.maximum_size=3342336
heltec_capsule_sensor_V3.upload.maximum_data_size=327680
heltec_capsule_sensor_V3.upload.flags=
heltec_capsule_sensor_V3.upload.extra_flags=
heltec_capsule_sensor_V3.upload.use_1200bps_touch=false
heltec_capsule_sensor_V3.upload.wait_for_upload_port=false

heltec_capsule_sensor_V3.serial.disableDTR=false
heltec_capsule_sensor_V3.serial.disableRTS=false

heltec_capsule_sensor_V3.build.tarch=xtensa
heltec_capsule_sensor_V3.build.bootloader_addr=0x0
heltec_capsule_sensor_V3.build.target=esp32s3
heltec_capsule_sensor_V3.build.mcu=esp32s3
heltec_capsule_sensor_V3.build.core=esp32
heltec_capsule_sensor_V3.build.variant=heltec_capsule_sensor_v3
heltec_capsule_sensor_V3.build.board=HELTEC_CAPSULE_SENSOR_V3

heltec_capsule_sensor_V3.build.usb_mode=1
heltec_capsule_sensor_V3.build.cdc_on_boot=0
heltec_capsule_sensor_V3.build.msc_on_boot=0
heltec_capsule_sensor_V3.build.dfu_on_boot=0
heltec_capsule_sensor_V3.build.f_cpu=240000000L
heltec_capsule_sensor_V3.build.flash_size=8MB
heltec_capsule_sensor_V3.build.flash_freq=80m
heltec_capsule_sensor_V3.build.flash_mode=dio
heltec_capsule_sensor_V3.build.boot=qio
heltec_capsule_sensor_V3.build.boot_freq=80m
heltec_capsule_sensor_V3.build.partitions=partitions
heltec_capsule_sensor_V3.build.loop_core=
heltec_capsule_sensor_V3.build.event_core=
heltec_capsule_sensor_V3.build.psram_type=qspi
heltec_capsule_sensor_V3.build.memory_type={build.boot}_{build.psram_type}

heltec_capsule_sensor_V3.menu.LoopCore.1=Core 1
heltec_capsule_sensor_V3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
heltec_capsule_sensor_V3.menu.LoopCore.0=Core 0
heltec_capsule_sensor_V3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

heltec_capsule_sensor_V3.menu.EventsCore.1=Core 1
heltec_capsule_sensor_V3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
heltec_capsule_sensor_V3.menu.EventsCore.0=Core 0
heltec_capsule_sensor_V3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

heltec_capsule_sensor_V3.menu.CPUFreq.240=240MHz (WiFi)
heltec_capsule_sensor_V3.menu.CPUFreq.240.build.f_cpu=240000000L
heltec_capsule_sensor_V3.menu.CPUFreq.160=160MHz (WiFi)
heltec_capsule_sensor_V3.menu.CPUFreq.160.build.f_cpu=160000000L
heltec_capsule_sensor_V3.menu.CPUFreq.80=80MHz (WiFi)
heltec_capsule_sensor_V3.menu.CPUFreq.80.build.f_cpu=80000000L
heltec_capsule_sensor_V3.menu.CPUFreq.40=40MHz
heltec_capsule_sensor_V3.menu.CPUFreq.40.build.f_cpu=40000000L
heltec_capsule_sensor_V3.menu.CPUFreq.20=20MHz
heltec_capsule_sensor_V3.menu.CPUFreq.20.build.f_cpu=20000000L
heltec_capsule_sensor_V3.menu.CPUFreq.10=10MHz
heltec_capsule_sensor_V3.menu.CPUFreq.10.build.f_cpu=10000000L

heltec_capsule_sensor_V3.menu.UploadSpeed.921600=921600
heltec_capsule_sensor_V3.menu.UploadSpeed.921600.upload.speed=921600
heltec_capsule_sensor_V3.menu.UploadSpeed.115200=115200
heltec_capsule_sensor_V3.menu.UploadSpeed.115200.upload.speed=115200
heltec_capsule_sensor_V3.menu.UploadSpeed.256000.windows=256000
heltec_capsule_sensor_V3.menu.UploadSpeed.256000.upload.speed=256000
heltec_capsule_sensor_V3.menu.UploadSpeed.230400.windows.upload.speed=256000
heltec_capsule_sensor_V3.menu.UploadSpeed.230400=230400
heltec_capsule_sensor_V3.menu.UploadSpeed.230400.upload.speed=230400
heltec_capsule_sensor_V3.menu.UploadSpeed.460800.linux=460800
heltec_capsule_sensor_V3.menu.UploadSpeed.460800.macosx=460800
heltec_capsule_sensor_V3.menu.UploadSpeed.460800.upload.speed=460800
heltec_capsule_sensor_V3.menu.UploadSpeed.512000.windows=512000
heltec_capsule_sensor_V3.menu.UploadSpeed.512000.upload.speed=512000

heltec_capsule_sensor_V3.menu.DebugLevel.none=None
heltec_capsule_sensor_V3.menu.DebugLevel.none.build.code_debug=0
heltec_capsule_sensor_V3.menu.DebugLevel.error=Error
heltec_capsule_sensor_V3.menu.DebugLevel.error.build.code_debug=1
heltec_capsule_sensor_V3.menu.DebugLevel.warn=Warn
heltec_capsule_sensor_V3.menu.DebugLevel.warn.build.code_debug=2
heltec_capsule_sensor_V3.menu.DebugLevel.info=Info
heltec_capsule_sensor_V3.menu.DebugLevel.info.build.code_debug=3
heltec_capsule_sensor_V3.menu.DebugLevel.debug=Debug
heltec_capsule_sensor_V3.menu.DebugLevel.debug.build.code_debug=4
heltec_capsule_sensor_V3.menu.DebugLevel.verbose=Verbose
heltec_capsule_sensor_V3.menu.DebugLevel.verbose.build.code_debug=5

heltec_capsule_sensor_V3.menu.LORAWAN_REGION.0=REGION_EU868
heltec_capsule_sensor_V3.menu.LORAWAN_REGION.0.build.band=REGION_EU868
heltec_capsule_sensor_V3.menu.LORAWAN_REGION.1=REGION_EU433
heltec_capsule_sensor_V3.menu.LORAWAN_REGION.1.build.band=REGION_EU433
heltec_capsule_sensor_V3.menu.LORAWAN_REGION.2=REGION_CN470
heltec_capsule_sensor_V3.menu.LORAWAN_REGION.2.build.band=REGION_CN470
heltec_capsule_sensor_V3.menu.LORAWAN_REGION.3=REGION_US915
heltec_capsule_sensor_V3.menu.LORAWAN_REGION.3.build.band=REGION_US915
heltec_capsule_sensor_V3.menu.LORAWAN_REGION.4=REGION_AU915
heltec_capsule_sensor_V3.menu.LORAWAN_REGION.4.build.band=REGION_AU915
heltec_capsule_sensor_V3.menu.LORAWAN_REGION.5=REGION_CN779
heltec_capsule_sensor_V3.menu.LORAWAN_REGION.5.build.band=REGION_CN779
heltec_capsule_sensor_V3.menu.LORAWAN_REGION.6=REGION_AS923
heltec_capsule_sensor_V3.menu.LORAWAN_REGION.6.build.band=REGION_AS923
heltec_capsule_sensor_V3.menu.LORAWAN_REGION.7=REGION_KR920
heltec_capsule_sensor_V3.menu.LORAWAN_REGION.7.build.band=REGION_KR920
heltec_capsule_sensor_V3.menu.LORAWAN_REGION.8=REGION_IN865
heltec_capsule_sensor_V3.menu.LORAWAN_REGION.8.build.band=REGION_IN865
heltec_capsule_sensor_V3.menu.LORAWAN_REGION.9=REGION_US915_HYBRID
heltec_capsule_sensor_V3.menu.LORAWAN_REGION.9.build.band=REGION_US915_HYBRID

heltec_capsule_sensor_V3.menu.LoRaWanDebugLevel.0=None
heltec_capsule_sensor_V3.menu.LoRaWanDebugLevel.0.build.LoRaWanDebugLevel=0
heltec_capsule_sensor_V3.menu.LoRaWanDebugLevel.1=Freq
heltec_capsule_sensor_V3.menu.LoRaWanDebugLevel.1.build.LoRaWanDebugLevel=1
heltec_capsule_sensor_V3.menu.LoRaWanDebugLevel.2=Freq && DIO
heltec_capsule_sensor_V3.menu.LoRaWanDebugLevel.2.build.LoRaWanDebugLevel=2
heltec_capsule_sensor_V3.menu.LoRaWanDebugLevel.3=Freq && DIO && PW
heltec_capsule_sensor_V3.menu.LoRaWanDebugLevel.3.build.LoRaWanDebugLevel=3

heltec_capsule_sensor_V3.menu.LORAWAN_DEVEUI.0=CUSTOM
heltec_capsule_sensor_V3.menu.LORAWAN_DEVEUI.0.build.LORAWAN_DEVEUI_AUTO=0
heltec_capsule_sensor_V3.menu.LORAWAN_DEVEUI.1=Generate By ChipID
heltec_capsule_sensor_V3.menu.LORAWAN_DEVEUI.1.build.LORAWAN_DEVEUI_AUTO=1

heltec_capsule_sensor_V3.menu.LORAWAN_PREAMBLE_LENGTH.0=8(default)
heltec_capsule_sensor_V3.menu.LORAWAN_PREAMBLE_LENGTH.0.build.LORAWAN_PREAMBLE_LENGTH=8
heltec_capsule_sensor_V3.menu.LORAWAN_PREAMBLE_LENGTH.1=16(For M00 and M00L)
heltec_capsule_sensor_V3.menu.LORAWAN_PREAMBLE_LENGTH.1.build.LORAWAN_PREAMBLE_LENGTH=16


heltec_capsule_sensor_V3.menu.SLOW_CLK_TPYE.0=External 32K (default)
heltec_capsule_sensor_V3.menu.SLOW_CLK_TPYE.0.build.SLOW_CLK_TPYE=1
heltec_capsule_sensor_V3.menu.SLOW_CLK_TPYE.1=Internal
heltec_capsule_sensor_V3.menu.SLOW_CLK_TPYE.1.build.SLOW_CLK_TPYE=0

heltec_capsule_sensor_V3.menu.NetworkLogLevel.0=NONE
heltec_capsule_sensor_V3.menu.NetworkLogLevel.0.build.NetworkLogLevel=0
heltec_capsule_sensor_V3.menu.NetworkLogLevel.1=ERROR
heltec_capsule_sensor_V3.menu.NetworkLogLevel.1.build.NetworkLogLevel=1
heltec_capsule_sensor_V3.menu.NetworkLogLevel.2=WARN
heltec_capsule_sensor_V3.menu.NetworkLogLevel.2.build.NetworkLogLevel=2
heltec_capsule_sensor_V3.menu.NetworkLogLevel.3=INFO
heltec_capsule_sensor_V3.menu.NetworkLogLevel.3.build.NetworkLogLevel=3

heltec_capsule_sensor_V3.build.defines=-D{build.band} -DMCU_ESP32_S3 -DHELTEC_BOARD=50 -DCAPSULE_SENSOR_V3 -DSLOW_CLK_TPYE={build.SLOW_CLK_TPYE} -DRADIO_CHIP_SX1262  -DLoRaWAN_DEBUG_LEVEL={build.LoRaWanDebugLevel} -DACTIVE_REGION=LORAMAC_{build.band} -DLORAWAN_PREAMBLE_LENGTH={build.LORAWAN_PREAMBLE_LENGTH} -DLORAWAN_DEVEUI_AUTO={build.LORAWAN_DEVEUI_AUTO} -D{build.board} -DNLOG_LOCAL_LEVEL={build.NetworkLogLevel}

heltec_capsule_sensor_V3.menu.EraseFlash.none=Disabled
heltec_capsule_sensor_V3.menu.EraseFlash.none.upload.erase_cmd=
heltec_capsule_sensor_V3.menu.EraseFlash.all=Enabled
heltec_capsule_sensor_V3.menu.EraseFlash.all.upload.erase_cmd=-e

#############################################################

