byrmeng/arduino-esp32-core/boards.txt
heltec_wireless_tracker.menu.LORAWAN_REGION.0=REGION_EU868
heltec_wireless_tracker.menu.LORAWAN_REGION.0.build.band=REGION_EU868
heltec_wireless_tracker.menu.LORAWAN_REGION.1=REGION_EU433
heltec_wireless_tracker.menu.LORAWAN_REGION.1.build.band=REGION_EU433
heltec_wireless_tracker.menu.LORAWAN_REGION.2=REGION_CN470
heltec_wireless_tracker.menu.LORAWAN_REGION.2.build.band=REGION_CN470
heltec_wireless_tracker.menu.LORAWAN_REGION.3=REGION_US915
heltec_wireless_tracker.menu.LORAWAN_REGION.3.build.band=REGION_US915
heltec_wireless_tracker.menu.LORAWAN_REGION.4=REGION_AU915
heltec_wireless_tracker.menu.LORAWAN_REGION.4.build.band=REGION_AU915
heltec_wireless_tracker.menu.LORAWAN_REGION.5=REGION_CN779
heltec_wireless_tracker.menu.LORAWAN_REGION.5.build.band=REGION_CN779
heltec_wireless_tracker.menu.LORAWAN_REGION.6=REGION_AS923
heltec_wireless_tracker.menu.LORAWAN_REGION.6.build.band=REGION_AS923
heltec_wireless_tracker.menu.LORAWAN_REGION.7=REGION_KR920
heltec_wireless_tracker.menu.LORAWAN_REGION.7.build.band=REGION_KR920
heltec_wireless_tracker.menu.LORAWAN_REGION.8=REGION_IN865
heltec_wireless_tracker.menu.LORAWAN_REGION.8.build.band=REGION_IN865
heltec_wireless_tracker.menu.LORAWAN_REGION.9=REGION_US915_HYBRID
heltec_wireless_tracker.menu.LORAWAN_REGION.9.build.band=REGION_US915_HYBRID

heltec_wireless_tracker.menu.LoRaWanDebugLevel.0=None
heltec_wireless_tracker.menu.LoRaWanDebugLevel.0.build.LoRaWanDebugLevel=0
heltec_wireless_tracker.menu.LoRaWanDebugLevel.1=Freq
heltec_wireless_tracker.menu.LoRaWanDebugLevel.1.build.LoRaWanDebugLevel=1
heltec_wireless_tracker.menu.LoRaWanDebugLevel.2=Freq && DIO
heltec_wireless_tracker.menu.LoRaWanDebugLevel.2.build.LoRaWanDebugLevel=2
heltec_wireless_tracker.menu.LoRaWanDebugLevel.3=Freq && DIO && PW
heltec_wireless_tracker.menu.LoRaWanDebugLevel.3.build.LoRaWanDebugLevel=3

heltec_wireless_tracker.menu.LORAWAN_DEVEUI.0=CUSTOM
heltec_wireless_tracker.menu.LORAWAN_DEVEUI.0.build.LORAWAN_DEVEUI_AUTO=0
heltec_wireless_tracker.menu.LORAWAN_DEVEUI.1=Generate By ChipID
heltec_wireless_tracker.menu.LORAWAN_DEVEUI.1.build.LORAWAN_DEVEUI_AUTO=1

heltec_wireless_tracker.menu.LORAWAN_PREAMBLE_LENGTH.0=8(default)
heltec_wireless_tracker.menu.LORAWAN_PREAMBLE_LENGTH.0.build.LORAWAN_PREAMBLE_LENGTH=8
heltec_wireless_tracker.menu.LORAWAN_PREAMBLE_LENGTH.1=16(For M00 and M00L)
heltec_wireless_tracker.menu.LORAWAN_PREAMBLE_LENGTH.1.build.LORAWAN_PREAMBLE_LENGTH=16

heltec_wireless_tracker.menu.SLOW_CLK_TPYE.0=Internal (default)
heltec_wireless_tracker.menu.SLOW_CLK_TPYE.0.build.SLOW_CLK_TPYE=0
heltec_wireless_tracker.menu.SLOW_CLK_TPYE.1=External 32K
heltec_wireless_tracker.menu.SLOW_CLK_TPYE.1.build.SLOW_CLK_TPYE=1

heltec_wireless_tracker.build.defines=-D{build.band}  -DMCU_ESP32_S3 -DHELTEC_BOARD=34 -DWIRELESS_TRACKER -DSLOW_CLK_TPYE={build.SLOW_CLK_TPYE} -DRADIO_CHIP_SX1262  -DLoRaWAN_DEBUG_LEVEL={build.LoRaWanDebugLevel} -DACTIVE_REGION=LORAMAC_{build.band} -DLORAWAN_PREAMBLE_LENGTH={build.LORAWAN_PREAMBLE_LENGTH} -DLORAWAN_DEVEUI_AUTO={build.LORAWAN_DEVEUI_AUTO} -D{build.board}

heltec_wireless_tracker.menu.EraseFlash.none=Disabled
heltec_wireless_tracker.menu.EraseFlash.none.upload.erase_cmd=
heltec_wireless_tracker.menu.EraseFlash.all=Enabled
heltec_wireless_tracker.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

heltec_wireless_mini_shell.name=Heltec Wireless Mini Shell

heltec_wireless_mini_shell.bootloader.tool=esptool_py
heltec_wireless_mini_shell.bootloader.tool.default=esptool_py

heltec_wireless_mini_shell.upload.tool=esptool_py
heltec_wireless_mini_shell.upload.tool.default=esptool_py
heltec_wireless_mini_shell.upload.tool.network=esp_ota

heltec_wireless_mini_shell.upload.maximum_size=1310720
heltec_wireless_mini_shell.upload.maximum_data_size=327680
heltec_wireless_mini_shell.upload.flags=
heltec_wireless_mini_shell.upload.extra_flags=
heltec_wireless_mini_shell.upload.use_1200bps_touch=false
heltec_wireless_mini_shell.upload.wait_for_upload_port=false

heltec_wireless_mini_shell.serial.disableDTR=false
heltec_wireless_mini_shell.serial.disableRTS=false

heltec_wireless_mini_shell.build.tarch=riscv32
heltec_wireless_mini_shell.build.target=esp
heltec_wireless_mini_shell.build.mcu=esp32c3
heltec_wireless_mini_shell.build.core=esp32
heltec_wireless_mini_shell.build.variant=heltec_wireless_mini_shell
heltec_wireless_mini_shell.build.board=HELTEC_WIRELESS_MINI_SHELL
heltec_wireless_mini_shell.build.bootloader_addr=0x0

heltec_wireless_mini_shell.build.cdc_on_boot=0
heltec_wireless_mini_shell.build.f_cpu=160000000L
heltec_wireless_mini_shell.build.flash_size=4MB
heltec_wireless_mini_shell.build.flash_freq=80m
heltec_wireless_mini_shell.build.flash_mode=dio
heltec_wireless_mini_shell.build.boot=qio
heltec_wireless_mini_shell.build.partitions=default

heltec_wireless_mini_shell.menu.LORAWAN_REGION.0=REGION_EU868
heltec_wireless_mini_shell.menu.LORAWAN_REGION.0.build.band=REGION_EU868
heltec_wireless_mini_shell.menu.LORAWAN_REGION.1=REGION_EU433
heltec_wireless_mini_shell.menu.LORAWAN_REGION.1.build.band=REGION_EU433
heltec_wireless_mini_shell.menu.LORAWAN_REGION.2=REGION_CN470
heltec_wireless_mini_shell.menu.LORAWAN_REGION.2.build.band=REGION_CN470
heltec_wireless_mini_shell.menu.LORAWAN_REGION.3=REGION_US915
heltec_wireless_mini_shell.menu.LORAWAN_REGION.3.build.band=REGION_US915
heltec_wireless_mini_shell.menu.LORAWAN_REGION.4=REGION_AU915
heltec_wireless_mini_shell.menu.LORAWAN_REGION.4.build.band=REGION_AU915
heltec_wireless_mini_shell.menu.LORAWAN_REGION.5=REGION_CN779
heltec_wireless_mini_shell.menu.LORAWAN_REGION.5.build.band=REGION_CN779
heltec_wireless_mini_shell.menu.LORAWAN_REGION.6=REGION_AS923
heltec_wireless_mini_shell.menu.LORAWAN_REGION.6.build.band=REGION_AS923
heltec_wireless_mini_shell.menu.LORAWAN_REGION.7=REGION_KR920
heltec_wireless_mini_shell.menu.LORAWAN_REGION.7.build.band=REGION_KR920
heltec_wireless_mini_shell.menu.LORAWAN_REGION.8=REGION_IN865
heltec_wireless_mini_shell.menu.LORAWAN_REGION.8.build.band=REGION_IN865
heltec_wireless_mini_shell.menu.LORAWAN_REGION.9=REGION_US915_HYBRID
heltec_wireless_mini_shell.menu.LORAWAN_REGION.9.build.band=REGION_US915_HYBRID

heltec_wireless_mini_shell.menu.CPUFreq.160=160MHz (WiFi)
heltec_wireless_mini_shell.menu.CPUFreq.160.build.f_cpu=160000000L
heltec_wireless_mini_shell.menu.CPUFreq.80=80MHz (WiFi)
heltec_wireless_mini_shell.menu.CPUFreq.80.build.f_cpu=80000000L
heltec_wireless_mini_shell.menu.CPUFreq.40=40MHz
heltec_wireless_mini_shell.menu.CPUFreq.40.build.f_cpu=40000000L
heltec_wireless_mini_shell.menu.CPUFreq.20=20MHz
heltec_wireless_mini_shell.menu.CPUFreq.20.build.f_cpu=20000000L
heltec_wireless_mini_shell.menu.CPUFreq.10=10MHz
heltec_wireless_mini_shell.menu.CPUFreq.10.build.f_cpu=10000000L

heltec_wireless_mini_shell.menu.UploadSpeed.921600=921600
heltec_wireless_mini_shell.menu.UploadSpeed.921600.upload.speed=921600
heltec_wireless_mini_shell.menu.UploadSpeed.115200=115200
heltec_wireless_mini_shell.menu.UploadSpeed.115200.upload.speed=115200
heltec_wireless_mini_shell.menu.UploadSpeed.256000.windows=256000
heltec_wireless_mini_shell.menu.UploadSpeed.256000.upload.speed=256000
heltec_wireless_mini_shell.menu.UploadSpeed.230400.windows.upload.speed=256000
heltec_wireless_mini_shell.menu.UploadSpeed.230400=230400
heltec_wireless_mini_shell.menu.UploadSpeed.230400.upload.speed=230400
heltec_wireless_mini_shell.menu.UploadSpeed.460800.linux=460800
heltec_wireless_mini_shell.menu.UploadSpeed.460800.macosx=460800
heltec_wireless_mini_shell.menu.UploadSpeed.460800.upload.speed=460800
heltec_wireless_mini_shell.menu.UploadSpeed.512000.windows=512000
heltec_wireless_mini_shell.menu.UploadSpeed.512000.upload.speed=512000

heltec_wireless_mini_shell.menu.DebugLevel.none=None
heltec_wireless_mini_shell.menu.DebugLevel.none.build.code_debug=0
heltec_wireless_mini_shell.menu.DebugLevel.error=Error
heltec_wireless_mini_shell.menu.DebugLevel.error.build.code_debug=1
heltec_wireless_mini_shell.menu.DebugLevel.warn=Warn
heltec_wireless_mini_shell.menu.DebugLevel.warn.build.code_debug=2
heltec_wireless_mini_shell.menu.DebugLevel.info=Info
heltec_wireless_mini_shell.menu.DebugLevel.info.build.code_debug=3
heltec_wireless_mini_shell.menu.DebugLevel.debug=Debug
heltec_wireless_mini_shell.menu.DebugLevel.debug.build.code_debug=4
heltec_wireless_mini_shell.menu.DebugLevel.verbose=Verbose
heltec_wireless_mini_shell.menu.DebugLevel.verbose.build.code_debug=5

