byrmeng/arduino-esp32-core/boards.txt
heltec_vision_master_e_213.menu.LORAWAN_DEVEUI.0=CUSTOM
heltec_vision_master_e_213.menu.LORAWAN_DEVEUI.0.build.LORAWAN_DEVEUI_AUTO=0
heltec_vision_master_e_213.menu.LORAWAN_DEVEUI.1=Generate By ChipID
heltec_vision_master_e_213.menu.LORAWAN_DEVEUI.1.build.LORAWAN_DEVEUI_AUTO=1

heltec_vision_master_e_213.menu.LORAWAN_PREAMBLE_LENGTH.0=8(default)
heltec_vision_master_e_213.menu.LORAWAN_PREAMBLE_LENGTH.0.build.LORAWAN_PREAMBLE_LENGTH=8
heltec_vision_master_e_213.menu.LORAWAN_PREAMBLE_LENGTH.1=16(For M00 and M00L)
heltec_vision_master_e_213.menu.LORAWAN_PREAMBLE_LENGTH.1.build.LORAWAN_PREAMBLE_LENGTH=16

heltec_vision_master_e_213.menu.SLOW_CLK_TPYE.0=Internal (default)
heltec_vision_master_e_213.menu.SLOW_CLK_TPYE.0.build.SLOW_CLK_TPYE=0
heltec_vision_master_e_213.menu.SLOW_CLK_TPYE.1=External 32K
heltec_vision_master_e_213.menu.SLOW_CLK_TPYE.1.build.SLOW_CLK_TPYE=1

heltec_vision_master_e_213.build.defines=-D{build.band}  -DMCU_ESP32_S3 -DHELTEC_BOARD=36 -DHELTEC_VISION_MASTER_E_213 -DSLOW_CLK_TPYE={build.SLOW_CLK_TPYE} -DRADIO_CHIP_SX1262  -DLoRaWAN_DEBUG_LEVEL={build.LoRaWanDebugLevel} -DACTIVE_REGION=LORAMAC_{build.band} -DLORAWAN_PREAMBLE_LENGTH={build.LORAWAN_PREAMBLE_LENGTH} -DLORAWAN_DEVEUI_AUTO={build.LORAWAN_DEVEUI_AUTO} -D{build.board}

heltec_vision_master_e_213.menu.EraseFlash.none=Disabled
heltec_vision_master_e_213.menu.EraseFlash.none.upload.erase_cmd=
heltec_vision_master_e_213.menu.EraseFlash.all=Enabled
heltec_vision_master_e_213.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

espectro32.name=ESPectro32

espectro32.bootloader.tool=esptool_py
espectro32.bootloader.tool.default=esptool_py

espectro32.upload.tool=esptool_py
espectro32.upload.tool.default=esptool_py
espectro32.upload.tool.network=esp_ota

espectro32.upload.maximum_size=1310720
espectro32.upload.maximum_data_size=327680
espectro32.upload.flags=
espectro32.upload.extra_flags=

espectro32.serial.disableDTR=true
espectro32.serial.disableRTS=true

espectro32.build.tarch=xtensa
espectro32.build.bootloader_addr=0x1000
espectro32.build.target=esp32
espectro32.build.mcu=esp32
espectro32.build.core=esp32
espectro32.build.variant=espectro32
espectro32.build.board=ESPECTRO32

espectro32.build.f_cpu=240000000L
espectro32.build.flash_size=4MB
espectro32.build.flash_mode=dio
espectro32.build.boot=dio
espectro32.build.partitions=default
espectro32.build.defines=

espectro32.menu.FlashMode.qio=QIO
espectro32.menu.FlashMode.qio.build.flash_mode=dio
espectro32.menu.FlashMode.qio.build.boot=qio
espectro32.menu.FlashMode.dio=DIO
espectro32.menu.FlashMode.dio.build.flash_mode=dio
espectro32.menu.FlashMode.dio.build.boot=dio

espectro32.menu.FlashFreq.80=80MHz
espectro32.menu.FlashFreq.80.build.flash_freq=80m
espectro32.menu.FlashFreq.40=40MHz
espectro32.menu.FlashFreq.40.build.flash_freq=40m

espectro32.menu.FlashSize.4M=4MB (32Mb)
espectro32.menu.FlashSize.4M.build.flash_size=4MB
espectro32.menu.FlashSize.2M=2MB (16Mb)
espectro32.menu.FlashSize.2M.build.flash_size=2MB

espectro32.menu.UploadSpeed.921600=921600
espectro32.menu.UploadSpeed.921600.upload.speed=921600
espectro32.menu.UploadSpeed.115200=115200
espectro32.menu.UploadSpeed.115200.upload.speed=115200
espectro32.menu.UploadSpeed.256000.windows=256000
espectro32.menu.UploadSpeed.256000.upload.speed=256000
espectro32.menu.UploadSpeed.230400.windows.upload.speed=256000
espectro32.menu.UploadSpeed.230400=230400
espectro32.menu.UploadSpeed.230400.upload.speed=230400
espectro32.menu.UploadSpeed.460800.linux=460800
espectro32.menu.UploadSpeed.460800.macosx=460800
espectro32.menu.UploadSpeed.460800.upload.speed=460800
espectro32.menu.UploadSpeed.512000.windows=512000
espectro32.menu.UploadSpeed.512000.upload.speed=512000

espectro32.menu.DebugLevel.none=None
espectro32.menu.DebugLevel.none.build.code_debug=0
espectro32.menu.DebugLevel.error=Error
espectro32.menu.DebugLevel.error.build.code_debug=1
espectro32.menu.DebugLevel.warn=Warn
espectro32.menu.DebugLevel.warn.build.code_debug=2
espectro32.menu.DebugLevel.info=Info
espectro32.menu.DebugLevel.info.build.code_debug=3
espectro32.menu.DebugLevel.debug=Debug
espectro32.menu.DebugLevel.debug.build.code_debug=4
espectro32.menu.DebugLevel.verbose=Verbose
espectro32.menu.DebugLevel.verbose.build.code_debug=5

espectro32.menu.EraseFlash.none=Disabled
espectro32.menu.EraseFlash.none.upload.erase_cmd=
espectro32.menu.EraseFlash.all=Enabled
espectro32.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

CoreESP32.name=Microduino-CoreESP32

CoreESP32.bootloader.tool=esptool_py
CoreESP32.bootloader.tool.default=esptool_py

CoreESP32.upload.tool=esptool_py
CoreESP32.upload.tool.default=esptool_py
CoreESP32.upload.tool.network=esp_ota

CoreESP32.upload.maximum_size=1310720
CoreESP32.upload.maximum_data_size=327680
CoreESP32.upload.flags=
CoreESP32.upload.extra_flags=

CoreESP32.serial.disableDTR=false
CoreESP32.serial.disableRTS=false

CoreESP32.build.tarch=xtensa
CoreESP32.build.bootloader_addr=0x1000
CoreESP32.build.target=esp32
CoreESP32.build.mcu=esp32
CoreESP32.build.core=esp32
CoreESP32.build.variant=Microduino-esp32
CoreESP32.build.board=CoreESP32

CoreESP32.build.f_cpu=240000000L
CoreESP32.build.flash_mode=dio
CoreESP32.build.flash_size=4MB
CoreESP32.build.boot=dio
CoreESP32.build.partitions=default
CoreESP32.build.defines=

CoreESP32.menu.PSRAM.disabled=Disabled
CoreESP32.menu.PSRAM.disabled.build.defines=
CoreESP32.menu.PSRAM.disabled.build.extra_libs=
CoreESP32.menu.PSRAM.enabled=Enabled
CoreESP32.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
CoreESP32.menu.PSRAM.enabled.build.extra_libs=

CoreESP32.menu.PartitionScheme.default=Default
CoreESP32.menu.PartitionScheme.default.build.partitions=default
CoreESP32.menu.PartitionScheme.minimal=Minimal (2MB FLASH)
CoreESP32.menu.PartitionScheme.minimal.build.partitions=minimal
CoreESP32.menu.PartitionScheme.no_ota=No OTA (Large APP)
CoreESP32.menu.PartitionScheme.no_ota.build.partitions=no_ota
CoreESP32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
CoreESP32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
CoreESP32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
CoreESP32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
CoreESP32.menu.PartitionScheme.fatflash=16M Fat
CoreESP32.menu.PartitionScheme.fatflash.build.partitions=ffat

CoreESP32.menu.FlashFreq.80=80MHz
CoreESP32.menu.FlashFreq.80.build.flash_freq=80m
CoreESP32.menu.FlashFreq.40=40MHz
CoreESP32.menu.FlashFreq.40.build.flash_freq=40m

CoreESP32.menu.UploadSpeed.921600=921600
CoreESP32.menu.UploadSpeed.921600.upload.speed=921600
CoreESP32.menu.UploadSpeed.115200=115200
CoreESP32.menu.UploadSpeed.115200.upload.speed=115200
CoreESP32.menu.UploadSpeed.256000.windows=256000
CoreESP32.menu.UploadSpeed.256000.upload.speed=256000
CoreESP32.menu.UploadSpeed.230400.windows.upload.speed=256000
CoreESP32.menu.UploadSpeed.230400=230400
CoreESP32.menu.UploadSpeed.230400.upload.speed=230400
CoreESP32.menu.UploadSpeed.460800.linux=460800
CoreESP32.menu.UploadSpeed.460800.macosx=460800
CoreESP32.menu.UploadSpeed.460800.upload.speed=460800
CoreESP32.menu.UploadSpeed.512000.windows=512000
CoreESP32.menu.UploadSpeed.512000.upload.speed=512000

CoreESP32.menu.DebugLevel.none=None
CoreESP32.menu.DebugLevel.none.build.code_debug=0
CoreESP32.menu.DebugLevel.error=Error
CoreESP32.menu.DebugLevel.error.build.code_debug=1
CoreESP32.menu.DebugLevel.warn=Warn
CoreESP32.menu.DebugLevel.warn.build.code_debug=2
CoreESP32.menu.DebugLevel.info=Info
CoreESP32.menu.DebugLevel.info.build.code_debug=3
CoreESP32.menu.DebugLevel.debug=Debug
CoreESP32.menu.DebugLevel.debug.build.code_debug=4
CoreESP32.menu.DebugLevel.verbose=Verbose
CoreESP32.menu.DebugLevel.verbose.build.code_debug=5

