byrmeng/arduino-esp32-core/boards.txt
wt32-eth01.menu.DebugLevel.none=None
wt32-eth01.menu.DebugLevel.none.build.code_debug=0
wt32-eth01.menu.DebugLevel.error=Error
wt32-eth01.menu.DebugLevel.error.build.code_debug=1
wt32-eth01.menu.DebugLevel.warn=Warn
wt32-eth01.menu.DebugLevel.warn.build.code_debug=2
wt32-eth01.menu.DebugLevel.info=Info
wt32-eth01.menu.DebugLevel.info.build.code_debug=3
wt32-eth01.menu.DebugLevel.debug=Debug
wt32-eth01.menu.DebugLevel.debug.build.code_debug=4
wt32-eth01.menu.DebugLevel.verbose=Verbose
wt32-eth01.menu.DebugLevel.verbose.build.code_debug=5

wt32-eth01.menu.EraseFlash.none=Disabled
wt32-eth01.menu.EraseFlash.none.upload.erase_cmd=
wt32-eth01.menu.EraseFlash.all=Enabled
wt32-eth01.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

wt32-sc01-plus.name=WT32-SC01 PLUS
wt32-sc01-plus.vid.0=0x303a
wt32-sc01-plus.pid.0=0x80D0

wt32-sc01-plus.bootloader.tool=esptool_py
wt32-sc01-plus.bootloader.tool.default=esptool_py

wt32-sc01-plus.upload.tool=esptool_py
wt32-sc01-plus.upload.tool.default=esptool_py
wt32-sc01-plus.upload.tool.network=esp_ota

wt32-sc01-plus.upload.maximum_size=1310720
wt32-sc01-plus.upload.maximum_data_size=327680
wt32-sc01-plus.upload.flags=
wt32-sc01-plus.upload.extra_flags=
wt32-sc01-plus.upload.use_1200bps_touch=false
wt32-sc01-plus.upload.wait_for_upload_port=false

wt32-sc01-plus.serial.disableDTR=false
wt32-sc01-plus.serial.disableRTS=false

wt32-sc01-plus.build.tarch=xtensa
wt32-sc01-plus.build.bootloader_addr=0x0
wt32-sc01-plus.build.target=esp32s3
wt32-sc01-plus.build.mcu=esp32s3
wt32-sc01-plus.build.core=esp32
wt32-sc01-plus.build.variant=wt32-sc01-plus
wt32-sc01-plus.build.board=WT32_SC01_PLUS

wt32-sc01-plus.build.usb_mode=1
wt32-sc01-plus.build.cdc_on_boot=1
wt32-sc01-plus.build.msc_on_boot=0
wt32-sc01-plus.build.dfu_on_boot=0
wt32-sc01-plus.build.f_cpu=240000000L
wt32-sc01-plus.build.flash_size=16MB
wt32-sc01-plus.build.flash_freq=80m
wt32-sc01-plus.build.flash_mode=dio
wt32-sc01-plus.build.boot=qio
wt32-sc01-plus.build.partitions=default
wt32-sc01-plus.build.defines=
wt32-sc01-plus.build.loop_core=
wt32-sc01-plus.build.event_core=
wt32-sc01-plus.build.flash_type=qio
wt32-sc01-plus.build.psram_type=qspi
wt32-sc01-plus.build.memory_type=qio_qspi

wt32-sc01-plus.menu.LoopCore.1=Core 1
wt32-sc01-plus.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
wt32-sc01-plus.menu.LoopCore.0=Core 0
wt32-sc01-plus.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

wt32-sc01-plus.menu.EventsCore.1=Core 1
wt32-sc01-plus.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
wt32-sc01-plus.menu.EventsCore.0=Core 0
wt32-sc01-plus.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

wt32-sc01-plus.menu.USBMode.hwcdc=Hardware CDC and JTAG
wt32-sc01-plus.menu.USBMode.hwcdc.build.usb_mode=1
wt32-sc01-plus.menu.USBMode.default=USB-OTG (TinyUSB)
wt32-sc01-plus.menu.USBMode.default.build.usb_mode=0

wt32-sc01-plus.menu.CDCOnBoot.cdc=Enabled
wt32-sc01-plus.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
wt32-sc01-plus.menu.CDCOnBoot.default=Disabled
wt32-sc01-plus.menu.CDCOnBoot.default.build.cdc_on_boot=0

wt32-sc01-plus.menu.MSCOnBoot.default=Disabled
wt32-sc01-plus.menu.MSCOnBoot.default.build.msc_on_boot=0
wt32-sc01-plus.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
wt32-sc01-plus.menu.MSCOnBoot.msc.build.msc_on_boot=1

wt32-sc01-plus.menu.DFUOnBoot.default=Disabled
wt32-sc01-plus.menu.DFUOnBoot.default.build.dfu_on_boot=0
wt32-sc01-plus.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
wt32-sc01-plus.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

wt32-sc01-plus.menu.UploadMode.cdc.upload.wait_for_upload_port=true
wt32-sc01-plus.menu.UploadMode.default=UART0 / Hardware CDC
wt32-sc01-plus.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
wt32-sc01-plus.menu.UploadMode.cdc.upload.use_1200bps_touch=true
wt32-sc01-plus.menu.UploadMode.default.upload.use_1200bps_touch=false
wt32-sc01-plus.menu.UploadMode.default.upload.wait_for_upload_port=false

wt32-sc01-plus.menu.PSRAM.enabled=Enabled
wt32-sc01-plus.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
wt32-sc01-plus.menu.PSRAM.disabled=Disabled
wt32-sc01-plus.menu.PSRAM.disabled.build.defines=

wt32-sc01-plus.menu.PartitionScheme.default_8MB=Default (3MB APP/1.5MB SPIFFS)
wt32-sc01-plus.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
wt32-sc01-plus.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
wt32-sc01-plus.menu.PartitionScheme.tinyuf2=TinyUF2 Compatibility (2MB APP/3.7MB FFAT)
wt32-sc01-plus.menu.PartitionScheme.tinyuf2.build.custom_bootloader=bootloader_tinyuf2
wt32-sc01-plus.menu.PartitionScheme.tinyuf2.build.custom_partitions=partitions_tinyuf2
wt32-sc01-plus.menu.PartitionScheme.tinyuf2.upload.extra_flags=0x410000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
wt32-sc01-plus.menu.PartitionScheme.tinyuf2.upload.maximum_size=2097152

wt32-sc01-plus.menu.CPUFreq.240=240MHz (WiFi)
wt32-sc01-plus.menu.CPUFreq.240.build.f_cpu=240000000L
wt32-sc01-plus.menu.CPUFreq.160=160MHz (WiFi)
wt32-sc01-plus.menu.CPUFreq.160.build.f_cpu=160000000L
wt32-sc01-plus.menu.CPUFreq.80=80MHz (WiFi)
wt32-sc01-plus.menu.CPUFreq.80.build.f_cpu=80000000L
wt32-sc01-plus.menu.CPUFreq.40=40MHz
wt32-sc01-plus.menu.CPUFreq.40.build.f_cpu=40000000L
wt32-sc01-plus.menu.CPUFreq.20=20MHz
wt32-sc01-plus.menu.CPUFreq.20.build.f_cpu=20000000L
wt32-sc01-plus.menu.CPUFreq.10=10MHz
wt32-sc01-plus.menu.CPUFreq.10.build.f_cpu=10000000L

wt32-sc01-plus.menu.FlashMode.qio=QIO
wt32-sc01-plus.menu.FlashMode.qio.build.flash_mode=dio
wt32-sc01-plus.menu.FlashMode.qio.build.boot=qio
wt32-sc01-plus.menu.FlashMode.dio=DIO
wt32-sc01-plus.menu.FlashMode.dio.build.flash_mode=dio
wt32-sc01-plus.menu.FlashMode.dio.build.boot=dio

wt32-sc01-plus.menu.UploadSpeed.921600=921600
wt32-sc01-plus.menu.UploadSpeed.921600.upload.speed=921600
wt32-sc01-plus.menu.UploadSpeed.115200=115200
wt32-sc01-plus.menu.UploadSpeed.115200.upload.speed=115200
wt32-sc01-plus.menu.UploadSpeed.256000.windows=256000
wt32-sc01-plus.menu.UploadSpeed.256000.upload.speed=256000
wt32-sc01-plus.menu.UploadSpeed.230400.windows.upload.speed=256000
wt32-sc01-plus.menu.UploadSpeed.230400=230400
wt32-sc01-plus.menu.UploadSpeed.230400.upload.speed=230400
wt32-sc01-plus.menu.UploadSpeed.460800.linux=460800
wt32-sc01-plus.menu.UploadSpeed.460800.macosx=460800
wt32-sc01-plus.menu.UploadSpeed.460800.upload.speed=460800
wt32-sc01-plus.menu.UploadSpeed.512000.windows=512000
wt32-sc01-plus.menu.UploadSpeed.512000.upload.speed=512000

wt32-sc01-plus.menu.DebugLevel.none=None
wt32-sc01-plus.menu.DebugLevel.none.build.code_debug=0
wt32-sc01-plus.menu.DebugLevel.error=Error
wt32-sc01-plus.menu.DebugLevel.error.build.code_debug=1
wt32-sc01-plus.menu.DebugLevel.warn=Warn
wt32-sc01-plus.menu.DebugLevel.warn.build.code_debug=2
wt32-sc01-plus.menu.DebugLevel.info=Info
wt32-sc01-plus.menu.DebugLevel.info.build.code_debug=3
wt32-sc01-plus.menu.DebugLevel.debug=Debug
wt32-sc01-plus.menu.DebugLevel.debug.build.code_debug=4
wt32-sc01-plus.menu.DebugLevel.verbose=Verbose
wt32-sc01-plus.menu.DebugLevel.verbose.build.code_debug=5

wt32-sc01-plus.menu.EraseFlash.none=Disabled
wt32-sc01-plus.menu.EraseFlash.none.upload.erase_cmd=
wt32-sc01-plus.menu.EraseFlash.all=Enabled
wt32-sc01-plus.menu.EraseFlash.all.upload.erase_cmd=-e

