byrmeng/arduino-esp32-core/boards.txt
lopy4.menu.FlashFreq.80=80MHz
lopy4.menu.FlashFreq.80.build.flash_freq=80m
lopy4.menu.FlashFreq.40=40MHz
lopy4.menu.FlashFreq.40.build.flash_freq=40m

lopy4.menu.UploadSpeed.921600=921600
lopy4.menu.UploadSpeed.921600.upload.speed=921600
lopy4.menu.UploadSpeed.115200=115200
lopy4.menu.UploadSpeed.115200.upload.speed=115200
lopy4.menu.UploadSpeed.256000.windows=256000
lopy4.menu.UploadSpeed.256000.upload.speed=256000
lopy4.menu.UploadSpeed.230400.windows.upload.speed=256000
lopy4.menu.UploadSpeed.230400=230400
lopy4.menu.UploadSpeed.230400.upload.speed=230400
lopy4.menu.UploadSpeed.460800.linux=460800
lopy4.menu.UploadSpeed.460800.macosx=460800
lopy4.menu.UploadSpeed.460800.upload.speed=460800
lopy4.menu.UploadSpeed.512000.windows=512000
lopy4.menu.UploadSpeed.512000.upload.speed=512000

lopy4.menu.DebugLevel.none=None
lopy4.menu.DebugLevel.none.build.code_debug=0
lopy4.menu.DebugLevel.error=Error
lopy4.menu.DebugLevel.error.build.code_debug=1
lopy4.menu.DebugLevel.warn=Warn
lopy4.menu.DebugLevel.warn.build.code_debug=2
lopy4.menu.DebugLevel.info=Info
lopy4.menu.DebugLevel.info.build.code_debug=3
lopy4.menu.DebugLevel.debug=Debug
lopy4.menu.DebugLevel.debug.build.code_debug=4
lopy4.menu.DebugLevel.verbose=Verbose
lopy4.menu.DebugLevel.verbose.build.code_debug=5

lopy4.menu.EraseFlash.none=Disabled
lopy4.menu.EraseFlash.none.upload.erase_cmd=
lopy4.menu.EraseFlash.all=Enabled
lopy4.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

oroca_edubot.name=OROCA EduBot

oroca_edubot.bootloader.tool=esptool_py
oroca_edubot.bootloader.tool.default=esptool_py

oroca_edubot.upload.tool=esptool_py
oroca_edubot.upload.tool.default=esptool_py
oroca_edubot.upload.tool.network=esp_ota

oroca_edubot.upload.maximum_size=3145728
oroca_edubot.upload.maximum_data_size=327680
oroca_edubot.upload.flags=
oroca_edubot.upload.extra_flags=

oroca_edubot.serial.disableDTR=true
oroca_edubot.serial.disableRTS=true

oroca_edubot.build.tarch=xtensa
oroca_edubot.build.bootloader_addr=0x1000
oroca_edubot.build.target=esp32
oroca_edubot.build.mcu=esp32
oroca_edubot.build.core=esp32
oroca_edubot.build.variant=oroca_edubot
oroca_edubot.build.board=OROCA_EDUBOT

oroca_edubot.build.f_cpu=240000000L
oroca_edubot.build.flash_mode=dio
oroca_edubot.build.flash_size=4MB
oroca_edubot.build.boot=dio
oroca_edubot.build.partitions=huge_app
oroca_edubot.build.defines=

oroca_edubot.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA)
oroca_edubot.menu.PartitionScheme.huge_app.build.partitions=huge_app
oroca_edubot.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
oroca_edubot.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
oroca_edubot.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
oroca_edubot.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

oroca_edubot.menu.FlashFreq.80=80MHz
oroca_edubot.menu.FlashFreq.80.build.flash_freq=80m
oroca_edubot.menu.FlashFreq.40=40MHz
oroca_edubot.menu.FlashFreq.40.build.flash_freq=40m

oroca_edubot.menu.UploadSpeed.921600=921600
oroca_edubot.menu.UploadSpeed.921600.upload.speed=921600
oroca_edubot.menu.UploadSpeed.115200=115200
oroca_edubot.menu.UploadSpeed.115200.upload.speed=115200
oroca_edubot.menu.UploadSpeed.256000.windows=256000
oroca_edubot.menu.UploadSpeed.256000.upload.speed=256000
oroca_edubot.menu.UploadSpeed.230400.windows.upload.speed=256000
oroca_edubot.menu.UploadSpeed.230400=230400
oroca_edubot.menu.UploadSpeed.230400.upload.speed=230400
oroca_edubot.menu.UploadSpeed.460800.linux=460800
oroca_edubot.menu.UploadSpeed.460800.macosx=460800
oroca_edubot.menu.UploadSpeed.460800.upload.speed=460800
oroca_edubot.menu.UploadSpeed.512000.windows=512000
oroca_edubot.menu.UploadSpeed.512000.upload.speed=512000

oroca_edubot.menu.DebugLevel.none=None
oroca_edubot.menu.DebugLevel.none.build.code_debug=0
oroca_edubot.menu.DebugLevel.error=Error
oroca_edubot.menu.DebugLevel.error.build.code_debug=1
oroca_edubot.menu.DebugLevel.warn=Warn
oroca_edubot.menu.DebugLevel.warn.build.code_debug=2
oroca_edubot.menu.DebugLevel.info=Info
oroca_edubot.menu.DebugLevel.info.build.code_debug=3
oroca_edubot.menu.DebugLevel.debug=Debug
oroca_edubot.menu.DebugLevel.debug.build.code_debug=4
oroca_edubot.menu.DebugLevel.verbose=Verbose
oroca_edubot.menu.DebugLevel.verbose.build.code_debug=5

oroca_edubot.menu.EraseFlash.none=Disabled
oroca_edubot.menu.EraseFlash.none.upload.erase_cmd=
oroca_edubot.menu.EraseFlash.all=Enabled
oroca_edubot.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

fm-devkit.name=ESP32 FM DevKit

fm-devkit.upload.tool=esptool_py
fm-devkit.upload.tool.default=esptool_py
fm-devkit.upload.tool.network=esp_ota

fm-devkit.upload.maximum_size=1310720
fm-devkit.upload.maximum_data_size=327680
fm-devkit.upload.flags=
fm-devkit.upload.extra_flags=

fm-devkit.serial.disableDTR=true
fm-devkit.serial.disableRTS=true

fm-devkit.build.tarch=xtensa
fm-devkit.build.bootloader_addr=0x1000
fm-devkit.build.target=esp32
fm-devkit.build.mcu=esp32
fm-devkit.build.core=esp32
fm-devkit.build.variant=fm-devkit
fm-devkit.build.board=fm_devkit

fm-devkit.build.f_cpu=240000000L
fm-devkit.build.flash_size=4MB
fm-devkit.build.flash_freq=80m
fm-devkit.build.flash_mode=dio
fm-devkit.build.boot=dio
fm-devkit.build.partitions=default
fm-devkit.build.defines=

fm-devkit.menu.UploadSpeed.921600=921600
fm-devkit.menu.UploadSpeed.921600.upload.speed=921600
fm-devkit.menu.UploadSpeed.115200=115200
fm-devkit.menu.UploadSpeed.115200.upload.speed=115200
fm-devkit.menu.UploadSpeed.256000.windows=256000
fm-devkit.menu.UploadSpeed.256000.upload.speed=256000
fm-devkit.menu.UploadSpeed.230400.windows.upload.speed=256000
fm-devkit.menu.UploadSpeed.230400=230400
fm-devkit.menu.UploadSpeed.230400.upload.speed=230400
fm-devkit.menu.UploadSpeed.460800.linux=460800
fm-devkit.menu.UploadSpeed.460800.macosx=460800
fm-devkit.menu.UploadSpeed.460800.upload.speed=460800
fm-devkit.menu.UploadSpeed.512000.windows=512000
fm-devkit.menu.UploadSpeed.512000.upload.speed=512000

