byrmeng/arduino-esp32-core/boards.txt
fri3d_2024_esp32s3.menu.UploadMode.default=UART0 / Hardware CDC
fri3d_2024_esp32s3.menu.UploadMode.default.upload.use_1200bps_touch=false
fri3d_2024_esp32s3.menu.UploadMode.default.upload.wait_for_upload_port=false
fri3d_2024_esp32s3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
fri3d_2024_esp32s3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
fri3d_2024_esp32s3.menu.UploadMode.cdc.upload.wait_for_upload_port=true

fri3d_2024_esp32s3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
fri3d_2024_esp32s3.menu.PartitionScheme.default.build.partitions=default
fri3d_2024_esp32s3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
fri3d_2024_esp32s3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
fri3d_2024_esp32s3.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
fri3d_2024_esp32s3.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
fri3d_2024_esp32s3.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
fri3d_2024_esp32s3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
fri3d_2024_esp32s3.menu.PartitionScheme.minimal.build.partitions=minimal
fri3d_2024_esp32s3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
fri3d_2024_esp32s3.menu.PartitionScheme.no_ota.build.partitions=no_ota
fri3d_2024_esp32s3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
fri3d_2024_esp32s3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
fri3d_2024_esp32s3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
fri3d_2024_esp32s3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
fri3d_2024_esp32s3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
fri3d_2024_esp32s3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
fri3d_2024_esp32s3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
fri3d_2024_esp32s3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
fri3d_2024_esp32s3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
fri3d_2024_esp32s3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
fri3d_2024_esp32s3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
fri3d_2024_esp32s3.menu.PartitionScheme.huge_app.build.partitions=huge_app
fri3d_2024_esp32s3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
fri3d_2024_esp32s3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
fri3d_2024_esp32s3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
fri3d_2024_esp32s3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
fri3d_2024_esp32s3.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
fri3d_2024_esp32s3.menu.PartitionScheme.fatflash.build.partitions=ffat
fri3d_2024_esp32s3.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
fri3d_2024_esp32s3.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
fri3d_2024_esp32s3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
fri3d_2024_esp32s3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
fri3d_2024_esp32s3.menu.PartitionScheme.rainmaker=RainMaker
fri3d_2024_esp32s3.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
fri3d_2024_esp32s3.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
fri3d_2024_esp32s3.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
fri3d_2024_esp32s3.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
fri3d_2024_esp32s3.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
fri3d_2024_esp32s3.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
fri3d_2024_esp32s3.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
fri3d_2024_esp32s3.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4116480

fri3d_2024_esp32s3.menu.CPUFreq.240=240MHz (WiFi)
fri3d_2024_esp32s3.menu.CPUFreq.240.build.f_cpu=240000000L
fri3d_2024_esp32s3.menu.CPUFreq.160=160MHz (WiFi)
fri3d_2024_esp32s3.menu.CPUFreq.160.build.f_cpu=160000000L
fri3d_2024_esp32s3.menu.CPUFreq.80=80MHz (WiFi)
fri3d_2024_esp32s3.menu.CPUFreq.80.build.f_cpu=80000000L
fri3d_2024_esp32s3.menu.CPUFreq.40=40MHz
fri3d_2024_esp32s3.menu.CPUFreq.40.build.f_cpu=40000000L
fri3d_2024_esp32s3.menu.CPUFreq.20=20MHz
fri3d_2024_esp32s3.menu.CPUFreq.20.build.f_cpu=20000000L
fri3d_2024_esp32s3.menu.CPUFreq.10=10MHz
fri3d_2024_esp32s3.menu.CPUFreq.10.build.f_cpu=10000000L

fri3d_2024_esp32s3.menu.UploadSpeed.921600=921600
fri3d_2024_esp32s3.menu.UploadSpeed.921600.upload.speed=921600
fri3d_2024_esp32s3.menu.UploadSpeed.115200=115200
fri3d_2024_esp32s3.menu.UploadSpeed.115200.upload.speed=115200
fri3d_2024_esp32s3.menu.UploadSpeed.256000.windows=256000
fri3d_2024_esp32s3.menu.UploadSpeed.256000.upload.speed=256000
fri3d_2024_esp32s3.menu.UploadSpeed.230400.windows.upload.speed=256000
fri3d_2024_esp32s3.menu.UploadSpeed.230400=230400
fri3d_2024_esp32s3.menu.UploadSpeed.230400.upload.speed=230400
fri3d_2024_esp32s3.menu.UploadSpeed.460800.linux=460800
fri3d_2024_esp32s3.menu.UploadSpeed.460800.macosx=460800
fri3d_2024_esp32s3.menu.UploadSpeed.460800.upload.speed=460800
fri3d_2024_esp32s3.menu.UploadSpeed.512000.windows=512000
fri3d_2024_esp32s3.menu.UploadSpeed.512000.upload.speed=512000

fri3d_2024_esp32s3.menu.DebugLevel.none=None
fri3d_2024_esp32s3.menu.DebugLevel.none.build.code_debug=0
fri3d_2024_esp32s3.menu.DebugLevel.error=Error
fri3d_2024_esp32s3.menu.DebugLevel.error.build.code_debug=1
fri3d_2024_esp32s3.menu.DebugLevel.warn=Warn
fri3d_2024_esp32s3.menu.DebugLevel.warn.build.code_debug=2
fri3d_2024_esp32s3.menu.DebugLevel.info=Info
fri3d_2024_esp32s3.menu.DebugLevel.info.build.code_debug=3
fri3d_2024_esp32s3.menu.DebugLevel.debug=Debug
fri3d_2024_esp32s3.menu.DebugLevel.debug.build.code_debug=4
fri3d_2024_esp32s3.menu.DebugLevel.verbose=Verbose
fri3d_2024_esp32s3.menu.DebugLevel.verbose.build.code_debug=5

fri3d_2024_esp32s3.menu.EraseFlash.none=Disabled
fri3d_2024_esp32s3.menu.EraseFlash.none.upload.erase_cmd=
fri3d_2024_esp32s3.menu.EraseFlash.all=Enabled
fri3d_2024_esp32s3.menu.EraseFlash.all.upload.erase_cmd=-e

