byrmeng/arduino-esp32-core/boards.txt
##############################################################

uPesy_wrover.name=uPesy ESP32 Wrover DevKit

uPesy_wrover.bootloader.tool=esptool_py
uPesy_wrover.bootloader.tool.default=esptool_py

uPesy_wrover.upload.tool=esptool_py
uPesy_wrover.upload.tool.default=esptool_py
uPesy_wrover.upload.tool.network=esp_ota

uPesy_wrover.upload.maximum_size=1310720
uPesy_wrover.upload.maximum_data_size=327680
uPesy_wrover.upload.flags=
uPesy_wrover.upload.extra_flags=

uPesy_wrover.serial.disableDTR=true
uPesy_wrover.serial.disableRTS=true

uPesy_wrover.build.tarch=xtensa
uPesy_wrover.build.bootloader_addr=0x1000
uPesy_wrover.build.target=esp32
uPesy_wrover.build.mcu=esp32
uPesy_wrover.build.core=esp32
uPesy_wrover.build.variant=uPesy_esp32_wrover_devkit
uPesy_wrover.build.board=UPESY_WROVER

uPesy_wrover.build.f_cpu=240000000L
uPesy_wrover.build.flash_size=4MB
uPesy_wrover.build.flash_freq=80m
uPesy_wrover.build.flash_mode=dio
uPesy_wrover.build.boot=dio
uPesy_wrover.build.partitions=default
uPesy_wrover.build.defines=

uPesy_wrover.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
uPesy_wrover.menu.PartitionScheme.default.build.partitions=default
uPesy_wrover.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
uPesy_wrover.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
uPesy_wrover.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
uPesy_wrover.menu.PartitionScheme.minimal.build.partitions=minimal
uPesy_wrover.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
uPesy_wrover.menu.PartitionScheme.no_ota.build.partitions=no_ota
uPesy_wrover.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
uPesy_wrover.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
uPesy_wrover.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
uPesy_wrover.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
uPesy_wrover.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
uPesy_wrover.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
uPesy_wrover.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
uPesy_wrover.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
uPesy_wrover.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
uPesy_wrover.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
uPesy_wrover.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
uPesy_wrover.menu.PartitionScheme.huge_app.build.partitions=huge_app
uPesy_wrover.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
uPesy_wrover.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
uPesy_wrover.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
uPesy_wrover.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

uPesy_wrover.menu.CPUFreq.240=240MHz
uPesy_wrover.menu.CPUFreq.240.build.f_cpu=240000000L
uPesy_wrover.menu.CPUFreq.160=160MHz
uPesy_wrover.menu.CPUFreq.160.build.f_cpu=160000000L

uPesy_wrover.menu.UploadSpeed.921600=921600
uPesy_wrover.menu.UploadSpeed.921600.upload.speed=921600
uPesy_wrover.menu.UploadSpeed.512000.windows=512000
uPesy_wrover.menu.UploadSpeed.512000.upload.speed=512000
uPesy_wrover.menu.UploadSpeed.460800.linux=460800
uPesy_wrover.menu.UploadSpeed.460800.macosx=460800
uPesy_wrover.menu.UploadSpeed.460800.upload.speed=460800
uPesy_wrover.menu.UploadSpeed.256000.windows=256000
uPesy_wrover.menu.UploadSpeed.256000.upload.speed=256000
uPesy_wrover.menu.UploadSpeed.230400.windows.upload.speed=256000
uPesy_wrover.menu.UploadSpeed.230400=230400
uPesy_wrover.menu.UploadSpeed.230400.upload.speed=230400
uPesy_wrover.menu.UploadSpeed.115200=115200
uPesy_wrover.menu.UploadSpeed.115200.upload.speed=115200

uPesy_wrover.menu.FlashMode.qio=QIO
uPesy_wrover.menu.FlashMode.qio.build.flash_mode=dio
uPesy_wrover.menu.FlashMode.qio.build.boot=qio
uPesy_wrover.menu.FlashMode.dio=DIO
uPesy_wrover.menu.FlashMode.dio.build.flash_mode=dio
uPesy_wrover.menu.FlashMode.dio.build.boot=dio

uPesy_wrover.menu.FlashFreq.80=80MHz
uPesy_wrover.menu.FlashFreq.80.build.flash_freq=80m
uPesy_wrover.menu.FlashFreq.40=40MHz
uPesy_wrover.menu.FlashFreq.40.build.flash_freq=40m

uPesy_wrover.menu.PSRAM.enabled=Enabled
uPesy_wrover.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
uPesy_wrover.menu.PSRAM.enabled.build.extra_libs=
uPesy_wrover.menu.PSRAM.disabled=Disabled
uPesy_wrover.menu.PSRAM.disabled.build.defines=
uPesy_wrover.menu.PSRAM.disabled.build.extra_libs=

uPesy_wrover.menu.DebugLevel.none=None
uPesy_wrover.menu.DebugLevel.none.build.code_debug=0
uPesy_wrover.menu.DebugLevel.error=Error
uPesy_wrover.menu.DebugLevel.error.build.code_debug=1
uPesy_wrover.menu.DebugLevel.warn=Warn
uPesy_wrover.menu.DebugLevel.warn.build.code_debug=2
uPesy_wrover.menu.DebugLevel.info=Info
uPesy_wrover.menu.DebugLevel.info.build.code_debug=3
uPesy_wrover.menu.DebugLevel.debug=Debug
uPesy_wrover.menu.DebugLevel.debug.build.code_debug=4
uPesy_wrover.menu.DebugLevel.verbose=Verbose
uPesy_wrover.menu.DebugLevel.verbose.build.code_debug=5

uPesy_wrover.menu.EraseFlash.none=Disabled
uPesy_wrover.menu.EraseFlash.none.upload.erase_cmd=
uPesy_wrover.menu.EraseFlash.all=Enabled
uPesy_wrover.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

uPesy_wroom.name=uPesy ESP32 Wroom DevKit

uPesy_wroom.bootloader.tool=esptool_py
uPesy_wroom.bootloader.tool.default=esptool_py

uPesy_wroom.upload.tool=esptool_py
uPesy_wroom.upload.tool.default=esptool_py
uPesy_wroom.upload.tool.network=esp_ota

uPesy_wroom.upload.maximum_size=1310720
uPesy_wroom.upload.maximum_data_size=327680
uPesy_wroom.upload.flags=
uPesy_wroom.upload.extra_flags=

uPesy_wroom.serial.disableDTR=true
uPesy_wroom.serial.disableRTS=true

uPesy_wroom.build.tarch=xtensa
uPesy_wroom.build.bootloader_addr=0x1000
uPesy_wroom.build.target=esp32
uPesy_wroom.build.mcu=esp32
uPesy_wroom.build.core=esp32
uPesy_wroom.build.variant=uPesy_esp32_wroom_devkit
uPesy_wroom.build.board=UPESY_WROOM

uPesy_wroom.build.f_cpu=240000000L
uPesy_wroom.build.flash_size=4MB
uPesy_wroom.build.flash_freq=80m
uPesy_wroom.build.flash_mode=dio
uPesy_wroom.build.boot=dio
uPesy_wroom.build.partitions=default
uPesy_wroom.build.defines=

uPesy_wroom.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
uPesy_wroom.menu.PartitionScheme.default.build.partitions=default
uPesy_wroom.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
uPesy_wroom.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
uPesy_wroom.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
uPesy_wroom.menu.PartitionScheme.minimal.build.partitions=minimal
uPesy_wroom.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
uPesy_wroom.menu.PartitionScheme.no_ota.build.partitions=no_ota
uPesy_wroom.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
uPesy_wroom.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
uPesy_wroom.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
uPesy_wroom.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
uPesy_wroom.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
uPesy_wroom.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
uPesy_wroom.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
uPesy_wroom.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
uPesy_wroom.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
uPesy_wroom.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
uPesy_wroom.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
uPesy_wroom.menu.PartitionScheme.huge_app.build.partitions=huge_app
uPesy_wroom.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
uPesy_wroom.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
uPesy_wroom.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
uPesy_wroom.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

uPesy_wroom.menu.CPUFreq.240=240MHz
uPesy_wroom.menu.CPUFreq.240.build.f_cpu=240000000L
uPesy_wroom.menu.CPUFreq.160=160MHz
uPesy_wroom.menu.CPUFreq.160.build.f_cpu=160000000L

