byrmeng/arduino-esp32-core/boards.txt
uPesy_wroom.menu.UploadSpeed.921600=921600
uPesy_wroom.menu.UploadSpeed.921600.upload.speed=921600
uPesy_wroom.menu.UploadSpeed.512000.windows=512000
uPesy_wroom.menu.UploadSpeed.512000.upload.speed=512000
uPesy_wroom.menu.UploadSpeed.460800.linux=460800
uPesy_wroom.menu.UploadSpeed.460800.macosx=460800
uPesy_wroom.menu.UploadSpeed.460800.upload.speed=460800
uPesy_wroom.menu.UploadSpeed.256000.windows=256000
uPesy_wroom.menu.UploadSpeed.256000.upload.speed=256000
uPesy_wroom.menu.UploadSpeed.230400.windows.upload.speed=256000
uPesy_wroom.menu.UploadSpeed.230400=230400
uPesy_wroom.menu.UploadSpeed.230400.upload.speed=230400
uPesy_wroom.menu.UploadSpeed.115200=115200
uPesy_wroom.menu.UploadSpeed.115200.upload.speed=115200

uPesy_wroom.menu.FlashMode.qio=QIO
uPesy_wroom.menu.FlashMode.qio.build.flash_mode=dio
uPesy_wroom.menu.FlashMode.qio.build.boot=qio
uPesy_wroom.menu.FlashMode.dio=DIO
uPesy_wroom.menu.FlashMode.dio.build.flash_mode=dio
uPesy_wroom.menu.FlashMode.dio.build.boot=dio

uPesy_wroom.menu.FlashFreq.80=80MHz
uPesy_wroom.menu.FlashFreq.80.build.flash_freq=80m
uPesy_wroom.menu.FlashFreq.40=40MHz
uPesy_wroom.menu.FlashFreq.40.build.flash_freq=40m

uPesy_wroom.menu.DebugLevel.none=None
uPesy_wroom.menu.DebugLevel.none.build.code_debug=0
uPesy_wroom.menu.DebugLevel.error=Error
uPesy_wroom.menu.DebugLevel.error.build.code_debug=1
uPesy_wroom.menu.DebugLevel.warn=Warn
uPesy_wroom.menu.DebugLevel.warn.build.code_debug=2
uPesy_wroom.menu.DebugLevel.info=Info
uPesy_wroom.menu.DebugLevel.info.build.code_debug=3
uPesy_wroom.menu.DebugLevel.debug=Debug
uPesy_wroom.menu.DebugLevel.debug.build.code_debug=4
uPesy_wroom.menu.DebugLevel.verbose=Verbose
uPesy_wroom.menu.DebugLevel.verbose.build.code_debug=5

uPesy_wroom.menu.EraseFlash.none=Disabled
uPesy_wroom.menu.EraseFlash.none.upload.erase_cmd=
uPesy_wroom.menu.EraseFlash.all=Enabled
uPesy_wroom.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

uPesy_edu_esp32.name=uPesy EDU ESP32

uPesy_edu_esp32.bootloader.tool=esptool_py
uPesy_edu_esp32.bootloader.tool.default=esptool_py

uPesy_edu_esp32.upload.tool=esptool_py
uPesy_edu_esp32.upload.tool.default=esptool_py
uPesy_edu_esp32.upload.tool.network=esp_ota

uPesy_edu_esp32.upload.maximum_size=1310720
uPesy_edu_esp32.upload.maximum_data_size=327680
uPesy_edu_esp32.upload.flags=
uPesy_edu_esp32.upload.extra_flags=

uPesy_edu_esp32.serial.disableDTR=true
uPesy_edu_esp32.serial.disableRTS=true

uPesy_edu_esp32.build.tarch=xtensa
uPesy_edu_esp32.build.bootloader_addr=0x1000
uPesy_edu_esp32.build.target=esp32
uPesy_edu_esp32.build.mcu=esp32
uPesy_edu_esp32.build.core=esp32
uPesy_edu_esp32.build.variant=uPesy_edu_esp32
uPesy_edu_esp32.build.board=UPESY_EDU_ESP32

uPesy_edu_esp32.build.f_cpu=240000000L
uPesy_edu_esp32.build.flash_size=4MB
uPesy_edu_esp32.build.flash_freq=80m
uPesy_edu_esp32.build.flash_mode=dio
uPesy_edu_esp32.build.boot=dio
uPesy_edu_esp32.build.partitions=default
uPesy_edu_esp32.build.defines=

uPesy_edu_esp32.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
uPesy_edu_esp32.menu.PartitionScheme.default.build.partitions=default
uPesy_edu_esp32.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
uPesy_edu_esp32.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
uPesy_edu_esp32.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
uPesy_edu_esp32.menu.PartitionScheme.minimal.build.partitions=minimal
uPesy_edu_esp32.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
uPesy_edu_esp32.menu.PartitionScheme.no_ota.build.partitions=no_ota
uPesy_edu_esp32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
uPesy_edu_esp32.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
uPesy_edu_esp32.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
uPesy_edu_esp32.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
uPesy_edu_esp32.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
uPesy_edu_esp32.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
uPesy_edu_esp32.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
uPesy_edu_esp32.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
uPesy_edu_esp32.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
uPesy_edu_esp32.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
uPesy_edu_esp32.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
uPesy_edu_esp32.menu.PartitionScheme.huge_app.build.partitions=huge_app
uPesy_edu_esp32.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
uPesy_edu_esp32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
uPesy_edu_esp32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
uPesy_edu_esp32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

uPesy_edu_esp32.menu.CPUFreq.240=240MHz
uPesy_edu_esp32.menu.CPUFreq.240.build.f_cpu=240000000L
uPesy_edu_esp32.menu.CPUFreq.160=160MHz
uPesy_edu_esp32.menu.CPUFreq.160.build.f_cpu=160000000L

uPesy_edu_esp32.menu.UploadSpeed.921600=921600
uPesy_edu_esp32.menu.UploadSpeed.921600.upload.speed=921600
uPesy_edu_esp32.menu.UploadSpeed.512000.windows=512000
uPesy_edu_esp32.menu.UploadSpeed.512000.upload.speed=512000
uPesy_edu_esp32.menu.UploadSpeed.460800.linux=460800
uPesy_edu_esp32.menu.UploadSpeed.460800.macosx=460800
uPesy_edu_esp32.menu.UploadSpeed.460800.upload.speed=460800
uPesy_edu_esp32.menu.UploadSpeed.256000.windows=256000
uPesy_edu_esp32.menu.UploadSpeed.256000.upload.speed=256000
uPesy_edu_esp32.menu.UploadSpeed.230400.windows.upload.speed=256000
uPesy_edu_esp32.menu.UploadSpeed.230400=230400
uPesy_edu_esp32.menu.UploadSpeed.230400.upload.speed=230400
uPesy_edu_esp32.menu.UploadSpeed.115200=115200
uPesy_edu_esp32.menu.UploadSpeed.115200.upload.speed=115200

uPesy_edu_esp32.menu.FlashMode.qio=QIO
uPesy_edu_esp32.menu.FlashMode.qio.build.flash_mode=dio
uPesy_edu_esp32.menu.FlashMode.qio.build.boot=qio
uPesy_edu_esp32.menu.FlashMode.dio=DIO
uPesy_edu_esp32.menu.FlashMode.dio.build.flash_mode=dio
uPesy_edu_esp32.menu.FlashMode.dio.build.boot=dio

uPesy_edu_esp32.menu.FlashFreq.80=80MHz
uPesy_edu_esp32.menu.FlashFreq.80.build.flash_freq=80m
uPesy_edu_esp32.menu.FlashFreq.40=40MHz
uPesy_edu_esp32.menu.FlashFreq.40.build.flash_freq=40m

uPesy_edu_esp32.menu.DebugLevel.none=None
uPesy_edu_esp32.menu.DebugLevel.none.build.code_debug=0
uPesy_edu_esp32.menu.DebugLevel.error=Error
uPesy_edu_esp32.menu.DebugLevel.error.build.code_debug=1
uPesy_edu_esp32.menu.DebugLevel.warn=Warn
uPesy_edu_esp32.menu.DebugLevel.warn.build.code_debug=2
uPesy_edu_esp32.menu.DebugLevel.info=Info
uPesy_edu_esp32.menu.DebugLevel.info.build.code_debug=3
uPesy_edu_esp32.menu.DebugLevel.debug=Debug
uPesy_edu_esp32.menu.DebugLevel.debug.build.code_debug=4
uPesy_edu_esp32.menu.DebugLevel.verbose=Verbose
uPesy_edu_esp32.menu.DebugLevel.verbose.build.code_debug=5

uPesy_edu_esp32.menu.EraseFlash.none=Disabled
uPesy_edu_esp32.menu.EraseFlash.none.upload.erase_cmd=
uPesy_edu_esp32.menu.EraseFlash.all=Enabled
uPesy_edu_esp32.menu.EraseFlash.all.upload.erase_cmd=-e

